<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">
    <id>https://khanhquoc.press/</id>
    <title>Khanh Quoc Press</title>
    <updated>2018-06-27T22:12:05Z</updated>
    <author>
        <name>Quoc Khanh</name>
        <email>khanhbq@innoteq.vn</email>
        <uri>https://khanhquoc.press/about</uri>
    </author>
    <link rel="alternate" href="https://khanhquoc.press"/>
    <subtitle>By Quoc Khanh — a believer, dreamer and maker of things.</subtitle>
    <rights>All rights reserved  2018, Sid Jain</rights>
    <generator>Feed for Node.js</generator>
    <entry>
        <title type="html"><![CDATA[Chúng ta còn lại gì]]></title>
        <id>https://khanhquoc.press/blog/chung-ta-con-lai-gi/</id>
        <link href="https://khanhquoc.press/blog/chung-ta-con-lai-gi/">
        </link>
        <updated>2018-06-19T17:00:00Z</updated>
        <summary type="html"><![CDATA[Mọi thứ rồi sẽ thay đổi, điều đáng buồn là vì chúng ta cứ tưởng chúng ta vẫn giống ngày hôm qua, chúng ta của ngày mai vẫn giống của hôm nay nhưng 3 năm sau nhìn lại, mọi thứ đã bỏ ta mà đi mất rồi.]]></summary>
        <content type="html"><![CDATA[<figure><img src="https://khanhquoc.press/blog/chung-ta-con-lai-gi/hero.jpg" alt="&#x110;&#xEA;m mu&#x1ED9;n t&#x1EA1;i CTG" class="full-width"><figcaption>&#x110;&#xEA;m mu&#x1ED9;n t&#x1EA1;i CTG</figcaption></figure>
<p>H&#x1ED3;i t&#xF4;i &#x111;i h&#x1ECD;c, r&#x1EA5;t hay v&#xE0;o blog t&#xEA;n l&#xE0; <code>Heavenly Wind</code>. T&#xE1;c gi&#x1EA3; l&#xE0; m&#x1ED9;t anh t&#x1EA7;m h&#x1A1;n t&#xF4;i v&#xE0;i tu&#x1ED5;i, chia s&#x1EBB; nhi&#x1EC1;u th&#x1EE9;, truy&#x1EC7;n ng&#x1EAF;n, t&#x1EA3;n m&#x1EA1;n, nh&#x1EA1;c, &#x1EA3;nh, MBTI&#x2026; nhi&#x1EC1;u th&#x1EE9;. &#x110;&#x1ED1;i v&#x1EDB;i c&#x1EAD;u trai nh&#x1B0; t&#xF4;i l&#xFA;c &#x111;&#xF3;, l&#xE0; nhi&#x1EC1;u th&#x1EE9;.</p>
<p>R&#x1EA5;t l&#xE2;u sau n&#xE0;y t&#xF4;i c&#xF3; d&#x1ECB;p k&#x1EBF;t b&#x1EA1;n Facebook v&#x1EDB;i anh, v&#xE0;o l&#x1EA1;i blog c&#x169;, anh c&#x169;ng &#x111;&#xE3; b&#x1ECF; kh&#xF4;ng update v&#xE0;i n&#x103;m r&#x1ED3;i. T&#xF4;i c&#xF3; v&#xE0;i ng&#x1B0;&#x1EDD;i c&#x169;ng tr&#x1EA3;i qua tu&#x1ED5;i m&#x1A1; m&#x1ED9;ng b&#x1EB1;ng c&#xE1;ch hay ng&#xF3; v&#xE0;o blog c&#x1EE7;a anh. R&#x1ED3;i ch&#xFA;ng t&#xF4;i c&#xF9;ng v&#xE0;o &#x111;&#x1ECD;c l&#x1EA1;i, nh&#x1B0; nh&#xEC;n th&#x1EA5;y nh&#x1EEF;ng &#xEA;m &#x111;&#x1EC1;m m&#xE0; ch&#x1EC9; v&#xE0;i n&#x103;m tr&#x1B0;&#x1EDB;c ch&#xFA;ng t&#xF4;i v&#x1EAB;n &#x111;&#x1B0;&#x1EE3;c &#x111;&#x1EAF;m m&#xEC;nh v&#xE0;o &#x111;&#xF3;.</p>
<p>M&#x1ED9;t n&#x103;m tr&#x1EDF; l&#x1EA1;i &#x111;&#xE2;y, t&#xF4;i nh&#x1EAD;n ra t&#xF4;i kh&#xF4;ng vi&#x1EBF;t nh&#x1B0; tr&#x1B0;&#x1EDB;c n&#x1EEF;a. Kh&#xF4;ng ph&#x1EA3;i l&#xE0; nh&#x1EEF;ng d&#xF2;ng t&#x1EA3;n v&#x103;n l&#xE3;ng m&#x1EA1;n bay b&#x1ED5;ng nh&#x1B0; t&#xF4;i &#x111;&#xE3; t&#x1EEB;ng nh&#x1B0; v&#x1EAD;y.</p>
<p>T&#xF4;i c&#x169;ng kh&#xF4;ng hay vi&#x1EBF;t v&#x1EC1; nh&#x1EEF;ng &#x111;i&#x1EC1;u m&#x1A1; &#x1B0;&#x1EDB;c c&#x1EE7;a tu&#x1ED5;i tr&#x1EBB;, c&#x169;ng ch&#x1EB3;ng vi&#x1EBF;t v&#x1EC1; &#x111;i&#x1EC1;u ng&#x1ECD;t ng&#xE0;o c&#x1EE7;a t&#xEC;nh y&#xEA;u. Nh&#x1EEF;ng d&#xF2;ng ch&#x1EEF; nh&#x1B0; ng&#x1EAF;n l&#x1EA1;i, c&#xF4; &#x111;&#x1ECD;ng v&#xE0; t&#x129;nh m&#x1ECB;ch.</p>
<p>R&#x1ED3;i ai c&#x169;ng s&#x1EBD; kh&#xE1;c, anh &#x1EA5;y c&#x169;ng ch&#x1EB3;ng m&#xE3;i l&#xE0; m&#x1ED9;t blogger vi&#x1EBF;t v&#x1EC1; gi&#xF3; thi&#xEA;n &#x111;&#x1B0;&#x1EDD;ng v&#xE0; t&#xF4;i c&#x169;ng s&#x1EBD; ch&#x1EB3;ng c&#xF2;n l&#xE0; c&#x1EAD;u trai tr&#x1EBB; v&#xE0;o &#x111;&#xF3; &#x111;&#x1EC3; v&#x1EBD; l&#xEA;n h&#xEC;nh m&#x1EAB;u ng&#x1B0;&#x1EDD;i t&#xF4;i th&#xED;ch.</p>
<p>C&#xF3; m&#x1ED9;t h&#x1EAD;u b&#x1ED1;i comment v&#xE0;o video c&#x169; c&#x1EE7;a t&#xF4;i v&#x1EC1; tr&#x1B0;&#x1EDD;ng c&#x1EA5;p 3, &#xFD; &#x1EDB;i g&#x1ECD;i b&#x1EA1;n b&#xE8; v&#xE0;o &#x111;&#x1EC3; h&#xE9;t l&#xEA;n: &#x201C;ch&#xFA;ng m&#xE0;y &#x1A1;i v&#xE0;o xem tr&#x1B0;&#x1EDD;ng m&#xEC;nh 10 n&#x103;m tr&#x1B0;&#x1EDB;c n&#xE0;y&#x201D;. C&#x1EE9; nh&#x1B0; th&#x1EC3; ng&#xF4;i tr&#x1B0;&#x1EDD;ng b&#xE2;y gi&#x1EDD; ch&#x1EB3;ng mang b&#xF3;ng h&#xEC;nh g&#xEC; c&#x1EE7;a n&#xF3; &#x111;&#xE3; t&#x1EEB;ng nh&#x1B0; v&#x1EAD;y.</p>
<blockquote>
<p>M&#x1ECD;i th&#x1EE9; r&#x1ED3;i s&#x1EBD; thay &#x111;&#x1ED5;i, &#x111;i&#x1EC1;u &#x111;&#xE1;ng bu&#x1ED3;n l&#xE0; v&#xEC; ch&#xFA;ng ta c&#x1EE9; t&#x1B0;&#x1EDF;ng ch&#xFA;ng ta v&#x1EAB;n gi&#x1ED1;ng ng&#xE0;y h&#xF4;m qua, ch&#xFA;ng ta c&#x1EE7;a ng&#xE0;y mai v&#x1EAB;n gi&#x1ED1;ng c&#x1EE7;a h&#xF4;m nay nh&#x1B0;ng 3 n&#x103;m sau nh&#xEC;n l&#x1EA1;i, m&#x1ECD;i th&#x1EE9; &#x111;&#xE3; b&#x1ECF; ta m&#xE0; &#x111;i m&#x1EA5;t r&#x1ED3;i.</p>
</blockquote>
<p>&#x110;i&#x1EC1;u g&#xEC; s&#x1EBD; c&#xF2;n &#x1EDF; l&#x1EA1;i &#x111;&#x1EBF;n cu&#x1ED1;i c&#xF9;ng?</p>
]]></content>
        <author>
            <name>Quoc Khanh</name>
            <email>khanhbq@innoteq.vn</email>
            <uri>https://khanhquoc.press/about</uri>
        </author>
    </entry>
</feed>