<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">
    <id>https://khanhquoc.press/</id>
    <title>Khanh Quoc Press</title>
    <updated>2018-06-29T17:36:47Z</updated>
    <author>
        <name>Quoc Khanh</name>
        <email>khanhbq@innoteq.vn</email>
        <uri>https://khanhquoc.press/about</uri>
    </author>
    <link rel="alternate" href="https://khanhquoc.press"/>
    <subtitle>By Quoc Khanh — a believer, dreamer and maker of things.</subtitle>
    <rights>All rights reserved  2018, Sid Jain</rights>
    <generator>Feed for Node.js</generator>
    <entry>
        <title type="html"><![CDATA[Chiều về muộn trên đường khởi nghiệp]]></title>
        <id>https://khanhquoc.press/blog/chieu-ve-muon-tren-duong-khoi-nghiep/</id>
        <link href="https://khanhquoc.press/blog/chieu-ve-muon-tren-duong-khoi-nghiep/">
        </link>
        <updated>2017-06-13T17:00:00Z</updated>
        <summary type="html"><![CDATA[Người lập trình, thấy được sức mạnh của máy tính, của Internet, của thời đại Công Nghệ Thông Tin, ai mà không có cái tham vọng biến mấy dòng code thành những giá trị vượt trội...]]></summary>
        <content type="html"><![CDATA[<figure><img src="https://khanhquoc.press/blog/chieu-ve-muon-tren-duong-khoi-nghiep/waccoffee.jpg" alt="" class="full-width"></figure>
<p>Ng&#x1B0;&#x1EDD;i l&#x1EAD;p tr&#xEC;nh, th&#x1EA5;y &#x111;&#x1B0;&#x1EE3;c s&#x1EE9;c m&#x1EA1;nh c&#x1EE7;a m&#xE1;y t&#xED;nh, c&#x1EE7;a Internet, c&#x1EE7;a th&#x1EDD;i &#x111;&#x1EA1;i C&#xF4;ng Ngh&#x1EC7; Th&#xF4;ng Tin, ai m&#xE0; kh&#xF4;ng c&#xF3; c&#xE1;i tham v&#x1ECD;ng bi&#x1EBF;n m&#x1EA5;y d&#xF2;ng code th&#xE0;nh nh&#x1EEF;ng gi&#xE1; tr&#x1ECB; v&#x1B0;&#x1EE3;t tr&#x1ED9;i.</p>
<p><em>Nh&#x1B0;ng h&#xF4;m nay chi&#x1EC1;u v&#x1EC1; h&#x1A1;i mu&#x1ED9;n.</em></p>
<p>Ng&#xE0;y Google b&#x1EAF;t &#x111;&#x1EA7;u, &#x111;&#xE3; c&#xF3; h&#x1A1;n hai m&#x1B0;&#x1A1;i b&#x1ED9; m&#xE1;y t&#xEC;m ki&#x1EBF;m ho&#x1EA1;t &#x111;&#x1ED9;ng. Trong tay h&#x1ECD; l&#xE0; ba &#xFD; t&#x1B0;&#x1EDF;ng ch&#xED;nh: th&#x1ED1;ng k&#xEA; nhi&#x1EC1;u h&#x1A1;n, d&#xF9;ng nh&#x1EEF;ng li&#xEA;n k&#x1EBF;t &#x111;&#x1EC3; x&#x1EBF;p h&#x1EA1;ng c&#xE1;c k&#x1EBF;t qu&#x1EA3;, v&#xE0; &#x111;&#xED;ch &#x111;&#x1EBF;n ph&#x1EA3;i l&#xE0; m&#x1ED9;t trang t&#xEC;m ki&#x1EBF;m &#x111;&#x1B0;&#x1EE3;c t&#x1ED1;i gi&#x1EA3;n v&#x1EDB;i nh&#x1EEF;ng t&#x1EEB; kho&#xE1;.</p>
<p>Kh&#xF4;ng nghi ng&#x1EDD; g&#xEC; v&#x1EDB;i nh&#x1EEF;ng c&#xF4;ng ngh&#x1EC7; tuy&#x1EC7;t v&#x1EDD;i &#x111;&#x1B0;&#x1EE3;c t&#xED;nh h&#x1EE3;p trong Google, tuy nhi&#xEA;n v&#x1EC1; t&#x1ED5;ng th&#x1EC3;, k&#x1EBF; ho&#x1EA1;ch c&#x1EE7;a h&#x1ECD; th&#x1EF1;c s&#x1EF1; &#x111;&#x1A1;n gi&#x1EA3;n.</p>
<p><em>S&#x1EF1; kh&#xE1;c bi&#x1EC7;t n&#x1EB1;m &#x1EDF;, tr&#xEA;n t&#x1EA5;t c&#x1EA3;, h&#x1ECD; mu&#x1ED1;n l&#xE0;m ra m&#x1ED9;t trang web c&#xF3; th&#x1EC3; s&#x1EED; d&#x1EE5;ng t&#x1ED1;t!</em></p>
<figure><img src="https://khanhquoc.press/blog/chieu-ve-muon-tren-duong-khoi-nghiep/elevator.jpg" alt="" class="full-width"></figure>
<p>D&#xF9; cho &#x111;&#xED;ch &#x111;&#x1EBF;n hi&#x1EC7;n t&#x1EA1;i c&#x1EE7;a h&#x1ECD; c&#xF3; l&#x1EBD; &#x111;&#xE3; l&#x1EDB;n h&#x1A1;n r&#x1EA5;t nhi&#x1EC1;u v&#x1EDB;i t&#x1EA5;t th&#x1EA3;y h&#x1EC7; sinh th&#xE1;i kh&#x1ED5;ng l&#x1ED3;, nh&#x1B0;ng &#xFD; t&#x1B0;&#x1EDF;ng ban &#x111;&#x1EA7;u &#x111;&#xF3; &#x111;&#xE3; l&#xE0;m &#x111;&#x1B0;&#x1EE3;c r&#x1EA5;t nhi&#x1EC1;u &#x111;i&#x1EC1;u, kh&#xF4;ng ch&#x1EC9; mang &#x111;&#x1EBF;n kho&#x1EA3;n l&#x1EE3;i nhu&#x1EAD;n kh&#x1ED5;ng l&#x1ED3; m&#xE0; c&#xF2;n thay &#x111;&#x1ED5;i c&#xE1;ch th&#x1EBF; gi&#x1EDB;i giao ti&#x1EBF;p v&#x1EDB;i th&#xF4;ng tin, v&#x1EDB;i Internet.</p>
<blockquote>
<p>M&#x1ED9;t &#xFD; t&#x1B0;&#x1EDF;ng c&#xF3; th&#x1EC3; &#x111;&#xE3; t&#x1EEB;ng t&#x1ED3;n t&#x1EA1;i trong qu&#xE1; kh&#x1EE9;, kh&#xF4;ng c&#xF3; ngh&#x129;a n&#xF3; s&#x1EBD; kh&#xF4;ng ho&#x1EA1;t &#x111;&#x1ED9;ng trong t&#x1B0;&#x1A1;ng lai.</p>
</blockquote>
<p>&#x110;&#x1EEB;ng ng&#x1EA1;i l&#xE0;m c&#xE1;i m&#x1EDB;i, c&#x169;ng &#x111;&#x1EEB;ng ng&#x1EA1;i l&#xE0;m c&#xE1;i c&#x169;, h&#xE3;y l&#xE0;m t&#x1ED1;t c&#xE1;i m&#xEC;nh mu&#x1ED1;n l&#xE0;m.</p>
<h3>&#xDD; t&#x1B0;&#x1EDF;ng kh&#xF4;ng n&#xEA;n l&#xE0; th&#x1EE9; n&#xED;u gi&#x1EEF; b&#x1EA1;n b&#x1EAF;t &#x111;&#x1EA7;u.</h3>
<figure><img src="https://khanhquoc.press/blog/chieu-ve-muon-tren-duong-khoi-nghiep/night.jpg" alt="" class="full-width"></figure>
<p>T&#x1EAD;n h&#x1B0;&#x1EDF;ng nh&#x1EEF;ng kho&#x1EA3;nh kh&#x1EAF;c mu&#x1ED9;n c&#x1EE7;a bu&#x1ED5;i chi&#x1EC1;u, nh&#x1B0; ng&#xE0;y h&#xF4;m nay, tho&#x1EA3;ng nh&#xEC;n ra d&#xF2;ng ng&#x1B0;&#x1EDD;i ng&#x1B0;&#x1EE3;c xu&#xF4;i ngo&#xE0;i kia, ch&#x1EB3;ng ph&#xFA;t n&#xE0;o ng&#x1A1;i ngh&#x1EC9;.</p>
<p>V&#xEC; gi&#xE1; tr&#x1ECB; c&#x1EE7;a m&#x1ED9;t s&#x1EA3;n ph&#x1EA9;m c&#xF4;ng ngh&#x1EC7; n&#x1EB1;m &#x1EDF; gi&#xE1; tr&#x1ECB; m&#xE0; n&#xF3; &#x111;em &#x111;&#x1EBF;n cho ng&#x1B0;&#x1EDD;i s&#x1EED; d&#x1EE5;ng.</p>
<p>M&#x1ED9;t startup l&#xE0;m ra ti&#x1EC1;n b&#x1EB1;ng c&#xE1;ch thu h&#xFA;t ng&#x1B0;&#x1EDD;i d&#xF9;ng nhi&#x1EC1;u h&#x1A1;n l&#xE0; nh&#x1EEF;ng c&#xF4;ng ngh&#x1EC7; n&#xF3; s&#x1EDF; h&#x1EEF;u. R&#xF5; r&#xE0;ng, nh&#x1EEF;ng g&#xEC; con ng&#x1B0;&#x1EDD;i s&#x1EED; d&#x1EE5;ng ng&#xE0;y h&#xF4;m nay v&#x1EAB;n ch&#x1B0;a th&#x1EC3; khi&#x1EBF;n m&#x1ED9;t ai c&#xF3; th&#x1EC3; t&#x1EF1; h&#xE0;o. C&#xF2;n r&#x1EA5;t nhi&#x1EC1;u c&#xE1;c l&#x129;nh v&#x1EF1;c ch&#x1B0;a th&#x1EF1;c s&#x1EF1; t&#xEC;m ra gi&#x1EA3;i ph&#xE1;p c&#xF4;ng ngh&#x1EC7;, kh&#xF4;ng kh&#xE1;c g&#xEC; c&#xE1;c c&#xF4;ng c&#x1EE5; t&#xEC;m ki&#x1EBF;m tr&#x1B0;&#x1EDB;c Google.</p>
<p>M&#x1ED9;t l&#x1EA7;n n&#x1EEF;a, nh&#xEC;n ra d&#xF2;ng ng&#x1B0;&#x1EDD;i ng&#x1B0;&#x1EE3;c xu&#xF4;i ngo&#xE0;i kia, ch&#x1EB3;ng ph&#xFA;t n&#xE0;o ng&#x1A1;i ngh&#x1EC9;&#x2026;</p>
<figure><img src="https://khanhquoc.press/blog/chieu-ve-muon-tren-duong-khoi-nghiep/work.jpg" alt="" class="full-width"></figure>
<blockquote>
<p>L&#xE0;m &#x111;i&#x1EC1;u m&#xE0; b&#x1EA1;n y&#xEA;u th&#xED;ch, v&#xE0; nh&#x1EEF;ng ng&#x1B0;&#x1EDD;i xung quanh b&#x1EA1;n y&#xEA;u th&#xED;ch.</p>
</blockquote>
<p>&#x110;&#xEA;m &#x111;&#x1EBF;n bao tr&#xF9;m d&#xE3;y d&#xE3;y cao t&#x1EA7;ng gi&#x1EEF;a l&#xF2;ng th&#xE0;nh ph&#x1ED1;, &#x111;&#xE8;n &#x111;&#x1B0;&#x1EDD;ng s&#xE1;ng d&#x1EA7;n l&#xEA;n.
D&#x1EEB;ng l&#x1EA1;i, t&#xEC;m cho m&#xEC;nh ph&#xFA;t ngh&#x129; suy &#x1EDF; g&#xF3;c c&#xF4;ng vi&#xEA;n y&#xEA;n v&#x1EAF;ng, trong b&#x1ED9;n b&#x1EC1; cu&#x1ED9;c s&#x1ED1;ng, l&#x1EA1;i kh&#x1EDF;i &#x111;&#x1ED9;ng c&#xE1;i laptop nh&#x1ECF;, nhi&#x1EC1;u ho&#xE0;i b&#xE3;o, khi ngo&#xE0;i kia c&#xF2;n l&#xE0; ti&#x1EBF;ng k&#xE8;n inh &#x1ECF;i c&#x1EE7;a h&#xE0;ng xe chen ch&#xFA;t n&#x1ED1;i d&#xE0;i&#x2026;</p>
<p><em>C&#x1EA3;m h&#x1EE9;ng t&#x1EEB; <a href="https://www.startupschool.org/">Y Combinator</a>.</em></p>
]]></content>
        <author>
            <name>Quoc Khanh</name>
            <email>khanhbq@innoteq.vn</email>
            <uri>https://khanhquoc.press/about</uri>
        </author>
    </entry>
    <entry>
        <title type="html"><![CDATA[Chúng ta còn lại gì]]></title>
        <id>https://khanhquoc.press/blog/chung-ta-con-lai-gi/</id>
        <link href="https://khanhquoc.press/blog/chung-ta-con-lai-gi/">
        </link>
        <updated>2018-06-19T17:00:00Z</updated>
        <summary type="html"><![CDATA[Mọi thứ rồi sẽ thay đổi, điều đáng buồn là vì chúng ta cứ tưởng chúng ta vẫn giống ngày hôm qua, chúng ta của ngày mai vẫn giống của hôm nay nhưng 3 năm sau nhìn lại, mọi thứ đã bỏ ta mà đi mất rồi.]]></summary>
        <content type="html"><![CDATA[<figure><img src="https://khanhquoc.press/blog/chung-ta-con-lai-gi/hero.jpg" alt="" class="full-width"></figure>
<p>H&#x1ED3;i t&#xF4;i &#x111;i h&#x1ECD;c, r&#x1EA5;t hay v&#xE0;o blog t&#xEA;n l&#xE0; <code>Heavenly Wind</code>. T&#xE1;c gi&#x1EA3; l&#xE0; m&#x1ED9;t anh t&#x1EA7;m h&#x1A1;n t&#xF4;i v&#xE0;i tu&#x1ED5;i, chia s&#x1EBB; nhi&#x1EC1;u th&#x1EE9;, truy&#x1EC7;n ng&#x1EAF;n, t&#x1EA3;n m&#x1EA1;n, nh&#x1EA1;c, &#x1EA3;nh, MBTI&#x2026; nhi&#x1EC1;u th&#x1EE9;. &#x110;&#x1ED1;i v&#x1EDB;i c&#x1EAD;u trai nh&#x1B0; t&#xF4;i l&#xFA;c &#x111;&#xF3;, l&#xE0; nhi&#x1EC1;u th&#x1EE9;.</p>
<p>R&#x1EA5;t l&#xE2;u sau n&#xE0;y t&#xF4;i c&#xF3; d&#x1ECB;p k&#x1EBF;t b&#x1EA1;n Facebook v&#x1EDB;i anh, v&#xE0;o l&#x1EA1;i blog c&#x169;, anh c&#x169;ng &#x111;&#xE3; b&#x1ECF; kh&#xF4;ng update v&#xE0;i n&#x103;m r&#x1ED3;i. T&#xF4;i c&#xF3; v&#xE0;i ng&#x1B0;&#x1EDD;i c&#x169;ng tr&#x1EA3;i qua tu&#x1ED5;i m&#x1A1; m&#x1ED9;ng b&#x1EB1;ng c&#xE1;ch hay ng&#xF3; v&#xE0;o blog c&#x1EE7;a anh. R&#x1ED3;i ch&#xFA;ng t&#xF4;i c&#xF9;ng v&#xE0;o &#x111;&#x1ECD;c l&#x1EA1;i, nh&#x1B0; nh&#xEC;n th&#x1EA5;y nh&#x1EEF;ng &#xEA;m &#x111;&#x1EC1;m m&#xE0; ch&#x1EC9; v&#xE0;i n&#x103;m tr&#x1B0;&#x1EDB;c ch&#xFA;ng t&#xF4;i v&#x1EAB;n &#x111;&#x1B0;&#x1EE3;c &#x111;&#x1EAF;m m&#xEC;nh v&#xE0;o &#x111;&#xF3;.</p>
<p>M&#x1ED9;t n&#x103;m tr&#x1EDF; l&#x1EA1;i &#x111;&#xE2;y, t&#xF4;i nh&#x1EAD;n ra t&#xF4;i kh&#xF4;ng vi&#x1EBF;t nh&#x1B0; tr&#x1B0;&#x1EDB;c n&#x1EEF;a. Kh&#xF4;ng ph&#x1EA3;i l&#xE0; nh&#x1EEF;ng d&#xF2;ng t&#x1EA3;n v&#x103;n l&#xE3;ng m&#x1EA1;n bay b&#x1ED5;ng nh&#x1B0; t&#xF4;i &#x111;&#xE3; t&#x1EEB;ng nh&#x1B0; v&#x1EAD;y.</p>
<p>T&#xF4;i c&#x169;ng kh&#xF4;ng hay vi&#x1EBF;t v&#x1EC1; nh&#x1EEF;ng &#x111;i&#x1EC1;u m&#x1A1; &#x1B0;&#x1EDB;c c&#x1EE7;a tu&#x1ED5;i tr&#x1EBB;, c&#x169;ng ch&#x1EB3;ng vi&#x1EBF;t v&#x1EC1; &#x111;i&#x1EC1;u ng&#x1ECD;t ng&#xE0;o c&#x1EE7;a t&#xEC;nh y&#xEA;u. Nh&#x1EEF;ng d&#xF2;ng ch&#x1EEF; nh&#x1B0; ng&#x1EAF;n l&#x1EA1;i, c&#xF4; &#x111;&#x1ECD;ng v&#xE0; t&#x129;nh m&#x1ECB;ch.</p>
<p>R&#x1ED3;i ai c&#x169;ng s&#x1EBD; kh&#xE1;c, anh &#x1EA5;y c&#x169;ng ch&#x1EB3;ng m&#xE3;i l&#xE0; m&#x1ED9;t blogger vi&#x1EBF;t v&#x1EC1; gi&#xF3; thi&#xEA;n &#x111;&#x1B0;&#x1EDD;ng v&#xE0; t&#xF4;i c&#x169;ng s&#x1EBD; ch&#x1EB3;ng c&#xF2;n l&#xE0; c&#x1EAD;u trai tr&#x1EBB; v&#xE0;o &#x111;&#xF3; &#x111;&#x1EC3; v&#x1EBD; l&#xEA;n h&#xEC;nh m&#x1EAB;u ng&#x1B0;&#x1EDD;i t&#xF4;i th&#xED;ch.</p>
<p>C&#xF3; m&#x1ED9;t h&#x1EAD;u b&#x1ED1;i comment v&#xE0;o video c&#x169; c&#x1EE7;a t&#xF4;i v&#x1EC1; tr&#x1B0;&#x1EDD;ng c&#x1EA5;p 3, &#xFD; &#x1EDB;i g&#x1ECD;i b&#x1EA1;n b&#xE8; v&#xE0;o &#x111;&#x1EC3; h&#xE9;t l&#xEA;n: &#x201C;ch&#xFA;ng m&#xE0;y &#x1A1;i v&#xE0;o xem tr&#x1B0;&#x1EDD;ng m&#xEC;nh 10 n&#x103;m tr&#x1B0;&#x1EDB;c n&#xE0;y&#x201D;. C&#x1EE9; nh&#x1B0; th&#x1EC3; ng&#xF4;i tr&#x1B0;&#x1EDD;ng b&#xE2;y gi&#x1EDD; ch&#x1EB3;ng mang b&#xF3;ng h&#xEC;nh g&#xEC; c&#x1EE7;a n&#xF3; &#x111;&#xE3; t&#x1EEB;ng nh&#x1B0; v&#x1EAD;y.</p>
<blockquote>
<p>M&#x1ECD;i th&#x1EE9; r&#x1ED3;i s&#x1EBD; thay &#x111;&#x1ED5;i, &#x111;i&#x1EC1;u &#x111;&#xE1;ng bu&#x1ED3;n l&#xE0; v&#xEC; ch&#xFA;ng ta c&#x1EE9; t&#x1B0;&#x1EDF;ng ch&#xFA;ng ta v&#x1EAB;n gi&#x1ED1;ng ng&#xE0;y h&#xF4;m qua, ch&#xFA;ng ta c&#x1EE7;a ng&#xE0;y mai v&#x1EAB;n gi&#x1ED1;ng c&#x1EE7;a h&#xF4;m nay nh&#x1B0;ng 3 n&#x103;m sau nh&#xEC;n l&#x1EA1;i, m&#x1ECD;i th&#x1EE9; &#x111;&#xE3; b&#x1ECF; ta m&#xE0; &#x111;i m&#x1EA5;t r&#x1ED3;i.</p>
</blockquote>
<p>&#x110;i&#x1EC1;u g&#xEC; s&#x1EBD; c&#xF2;n &#x1EDF; l&#x1EA1;i &#x111;&#x1EBF;n cu&#x1ED1;i c&#xF9;ng?</p>
]]></content>
        <author>
            <name>Quoc Khanh</name>
            <email>khanhbq@innoteq.vn</email>
            <uri>https://khanhquoc.press/about</uri>
        </author>
    </entry>
    <entry>
        <title type="html"><![CDATA[Dành cho 2016]]></title>
        <id>https://khanhquoc.press/blog/danh-cho-2016/</id>
        <link href="https://khanhquoc.press/blog/danh-cho-2016/">
        </link>
        <updated>2016-12-29T17:00:00Z</updated>
        <summary type="html"><![CDATA[Dành cho 2016, một năm của buồn vui cuối cùng cũng đến lúc phải buông tay...]]></summary>
        <content type="html"><![CDATA[<figure><img src="https://khanhquoc.press/blog/danh-cho-2016/beer-saigon.jpg" alt="&quot;The first night in Saigon, watching a football match and have a drink, good beer though.&quot;" class="full-width"><figcaption>&quot;The first night in Saigon, watching a football match and have a drink, good beer though.&quot;</figcaption></figure>
<blockquote>
<p>D&#xE0;nh cho 2016, m&#x1ED9;t n&#x103;m c&#x1EE7;a bu&#x1ED3;n vui cu&#x1ED1;i c&#xF9;ng c&#x169;ng &#x111;&#x1EBF;n l&#xFA;c ph&#x1EA3;i bu&#xF4;ng tay</p>
</blockquote>
<p>nh&#x1B0; nh&#x1EEF;ng c&#x1A1;n gi&#xF3; m&#xF9;a &#x111;&#xF4;ng v&#x1EC1; &#x111;&#xFA;ng h&#x1EB9;n</p>
<p>cu&#x1ED9;c &#x111;&#x1EDD;i b&#x1EAD;n r&#x1ED9;n</p>
<p>bi&#x1EBF;t bao l&#x1EA7;n tin r&#x1EB1;ng s&#x1EBD; ch&#x1EA1;y tr&#x1ED1;n</p>
<p>m&#xE0; v&#x1EAB;n c&#x1EE9; th&#x1EE9;c d&#x1EAD;y v&#x1EDB;i b&#xEC;nh minh&#x2026;</p>
<p>Ng&#xE0;y th&#xE1;ng n&#xE0;o m&#xEC;nh c&#xF2;n v&#x1EEF;ng tin n&#x1EAF;m gi&#x1EEF; &#x111;&#x1B0;&#x1EE3;c h&#xE0;nh tr&#xEC;nh</p>
<p>nh&#x1B0;ng c&#xE0;ng &#x111;i c&#xE0;ng th&#x1EA5;y l&#xF2;ng ng&#x1A1; ng&#xE1;c</p>
<p>&#x1EA3;o t&#x1B0;&#x1EDF;ng b&#x1EA3;n th&#xE2;n m&#xEC;nh t&#x1EEB;ng l&#xE0; th&#x1EE9; g&#xEC; &#x111;&#xF3; v&#x129; &#x111;&#x1EA1;i h&#x1A1;n h&#x1EA1;t c&#xE1;t</p>
<p>m&#xE0; ngo&#xE0;i kia &#x111;&#x1A1;n gi&#x1EA3;n</p>
<p>ch&#x1EC9; m&#x1ED9;t c&#x1A1;n gi&#xF3; th&#x1ED5;i qua.</p>
<p>&#x110;&#xE2;y l&#xE0; n&#x103;m th&#xE1;ng m&#xEC;nh &#x111;&#x1EE9;ng gi&#x1EEF;a l&#x1EA1;nh l&#xF9;ng v&#xE0; thi&#x1EBF;t tha&#x2026;</p>
]]></content>
        <author>
            <name>Quoc Khanh</name>
            <email>khanhbq@innoteq.vn</email>
            <uri>https://khanhquoc.press/about</uri>
        </author>
    </entry>
    <entry>
        <title type="html"><![CDATA[Điều quan trọng nhất]]></title>
        <id>https://khanhquoc.press/blog/dieu-quan-trong-nhat/</id>
        <link href="https://khanhquoc.press/blog/dieu-quan-trong-nhat/">
        </link>
        <updated>2018-05-26T17:00:00Z</updated>
        <summary type="html"><![CDATA[Tôi rảo bước trong những suy nghĩ vỡ vẩn. Sài Gòn một buổi chiều có nắng, hơi oi và đông đúc những dòng người qua lại.]]></summary>
        <content type="html"><![CDATA[<figure><img src="https://khanhquoc.press/blog/dieu-quan-trong-nhat/sunset.jpg" alt="&quot;Sunset at Quang Trung Software City.&quot;" class="full-width"><figcaption>&quot;Sunset at Quang Trung Software City.&quot;</figcaption></figure>
<p>T&#xF4;i r&#x1EA3;o b&#x1B0;&#x1EDB;c trong nh&#x1EEF;ng suy ngh&#x129; v&#x1EE1; v&#x1EA9;n. S&#xE0;i G&#xF2;n m&#x1ED9;t bu&#x1ED5;i chi&#x1EC1;u c&#xF3; n&#x1EAF;ng, h&#x1A1;i oi v&#xE0; &#x111;&#xF4;ng &#x111;&#xFA;c nh&#x1EEF;ng d&#xF2;ng ng&#x1B0;&#x1EDD;i qua l&#x1EA1;i</p>
<p>&#x110;&#xF4;i khi c&#xF3; nh&#x1EEF;ng &#x111;i&#x1EC1;u b&#xEC;nh d&#x1ECB; l&#x1EA1;i khi&#x1EBF;n b&#x1EA3;n th&#xE2;n dao &#x111;&#x1ED9;ng v&#xEC; nh&#x1EEF;ng th&#x1EE9; &#x111;&#xE3; t&#x1B0;&#x1EDF;ng nh&#x1B0; qua l&#xE2;u l&#x1EAF;m &#x1EA5;y.</p>
<p>Anh b&#x1EA1;n t&#xF4;i c&#xF3; m&#x1ED9;t ng&#x1B0;&#x1EDD;i b&#x1EA1;n, th&#x1EC9;nh tho&#x1EA3;ng &#x1EA3;nh k&#x1EC3; m&#x1EA5;y chuy&#x1EC7;n vu v&#x1A1; gi&#x1EEF;a hai ng&#x1B0;&#x1EDD;i, t&#xF4;i ch&#x1EC9; nghe nh&#x1B0; chuy&#x1EC7;n phi&#x1EBF;m gi&#x1EEF;a anh v&#xE0; t&#xF4;i.</p>
<p>Chi&#x1EC1;u nh&#x1EB9;, c&#xF3; n&#x1EAF;ng v&#xE0; h&#x1A1;i oi, anh n&#xF3;i v&#x1EC1; t&#xEC;nh b&#x1EA1;n &#x111;&#xF3;, &#x111;&#xE3; qua, gi&#x1ECD;ng nh&#x1B0; v&#x1ECD;ng l&#x1EA1;i t&#x1EEB; n&#x1A1;i xa l&#x1EAF;m.</p>
<p>Th&#x1EBF; v&#x1EAD;y, &#x111;&#xF4;i khi nh&#x1EEF;ng &#x111;i&#x1EC1;u b&#xEC;nh th&#x1B0;&#x1EDD;ng nh&#x1B0;ng &#x1EA9;n trong &#x111;&#xF3; l&#xE0; t&#x1EA5;t c&#x1EA3; t&#xEC;nh y&#xEA;u v&#xE0; t&#xF4;n tr&#x1ECD;ng.</p>
<p>Chi&#x1EC1;u nh&#x1EB9;, t&#xF4;i c&#x169;ng kh&#xF4;ng h&#x1ECF;i r&#x1EB1;ng chuy&#x1EC7;n v&#xEC; sao. Uh, c&#xE1;i g&#xEC; &#x111;&#xE3; qua l&#xE0; &#x111;&#xE3; qua, &#x111;&#xE3; qua r&#x1ED3;i.</p>
<blockquote>
<p>T&#xF4;i th&#x1EC9;nh tho&#x1EA3;ng t&#x1EF1; h&#x1ECF;i v&#x1EC1; &#x111;i&#x1EC1;u g&#xEC; l&#xE0; quan tr&#x1ECD;ng. &#x110;&#x1B0;&#x1EE3;c y&#xEA;u hay bi&#x1EBF;t m&#xEC;nh &#x111;&#x1B0;&#x1EE3;c y&#xEA;u.</p>
</blockquote>
]]></content>
        <author>
            <name>Quoc Khanh</name>
            <email>khanhbq@innoteq.vn</email>
            <uri>https://khanhquoc.press/about</uri>
        </author>
    </entry>
    <entry>
        <title type="html"><![CDATA[Học cách sống trọn vẹn hơn]]></title>
        <id>https://khanhquoc.press/blog/hoc-cach-song-tron-ven-hon/</id>
        <link href="https://khanhquoc.press/blog/hoc-cach-song-tron-ven-hon/">
        </link>
        <updated>2018-02-17T17:00:00Z</updated>
        <summary type="html"><![CDATA[Tôi biết một anh chàng trên Internet đã xem *Groundhog Day* (Ngày chuột chũi) 194 lần. Anh ta tên Robert Black, vẫn tiếp tục viết cho project có tên phim, với dòng giới thiệu “Watching a movie over and over again, a movie about living a day over and over again, because that is what life is all about”...]]></summary>
        <content type="html"><![CDATA[<blockquote>
<p>C&#xF3; nh&#x1EEF;ng b&#x1ED9; phim lu&#xF4;n hay h&#x1A1;n sau m&#x1ED7;i l&#x1EA7;n xem. T&#xF4;i c&#xF3; m&#x1ED9;t v&#xE0;i b&#x1ED9; phim kh&#xF4;ng bao gi&#x1EDD; x&#xF3;a. V&#xE0; th&#x1EAD;t l&#x1EA1; l&#xF9;ng b&#x1EDF;i ma thu&#x1EAD;t n&#xE0;y. Nh&#x1EEF;ng c&#x1EA3;nh phim v&#x1EAB;n th&#x1EBF;, &#xE2;m nh&#x1EA1;c v&#x1EAB;n th&#x1EBF;, di&#x1EC5;n vi&#xEA;n v&#x1EAB;n th&#x1EBF;, kh&#xF4;ng c&#xF3; g&#xEC; thay &#x111;&#x1ED5;i, nh&#x1B0;ng ta l&#x1EA1;i t&#xEC;m th&#x1EA5;y nh&#x1EEF;ng &#x111;i&#x1EC1;u m&#x1EDB;i, c&#x1EA3;m x&#xFA;c m&#x1EDB;i, nh&#x1EAD;n ra nh&#x1EEF;ng &#x111;i&#x1EC1;u ta ch&#x1B0;a th&#x1EA5;y tr&#x1B0;&#x1EDB;c &#x111;&#xE2;y v&#xE0; th&#x1EA5;m th&#xED;a h&#x1A1;n nh&#x1EEF;ng g&#xEC; ta &#x111;&#xE3; bi&#x1EBF;t.</p>
</blockquote>
<p>T&#xF4;i bi&#x1EBF;t m&#x1ED9;t anh ch&#xE0;ng tr&#xEA;n Internet &#x111;&#xE3; xem <em>Groundhog Day</em> (Ng&#xE0;y chu&#x1ED9;t ch&#x169;i) 194 l&#x1EA7;n. Anh ta t&#xEA;n Robert Black, v&#x1EAB;n ti&#x1EBF;p t&#x1EE5;c vi&#x1EBF;t cho project c&#xF3; t&#xEA;n phim, v&#x1EDB;i d&#xF2;ng gi&#x1EDB;i thi&#x1EC7;u &#x201C;Watching a movie over and over again, a movie about living a day over and over again, because that is what life is all about&#x201D; (Xem m&#x1ED9;t b&#x1ED9; phim h&#x1EBF;t l&#x1EA7;n n&#xE0;y &#x111;&#x1EBF;n l&#x1EA7;n kh&#xE1;c, b&#x1ED9; phim k&#x1EC3; v&#x1EC1; vi&#x1EC7;c s&#x1ED1;ng m&#x1ED9;t ng&#xE0;y m&#xE3;i m&#xE3;i, v&#xEC; &#x111;&#xF3; l&#xE0; c&#xE1;ch cu&#x1ED9;c s&#x1ED1;ng di&#x1EC5;n ra). Robert vi&#x1EBF;t v&#x1EC1; nh&#x1EEF;ng c&#x1EA3;m x&#xFA;c c&#x1EE7;a m&#xEC;nh khi &#x111;ang xem phim, v&#x1EC1; cu&#x1ED9;c s&#x1ED1;ng. B&#x1EA1;n c&#xF3; th&#x1EC3; t&#x1B0;&#x1EDF;ng t&#x1B0;&#x1EE3;ng &#x111;&#x1B0;&#x1EE3;c kh&#xF4;ng, h&#x1A1;n 200 entries trong hai n&#x103;m qua &#x111;&#x1EC1;u b&#x1EAF;t &#x111;&#x1EA7;u c&#xF9;ng m&#x1ED9;t c&#xE1;ch: anh xem m&#x1ED9;t c&#x1EA3;nh phim n&#xE0;o &#x111;&#xF3;, d&#x1EEB;ng l&#x1EA1;i v&#xE0; vi&#x1EBF;t.</p>
<p>Anh l&#xE0; minh ch&#x1EE9;ng cho vi&#x1EC7;c m&#x1ED9;t ng&#x1B0;&#x1EDD;i c&#xF3; th&#x1EC3; y&#xEA;u m&#x1ED9;t b&#x1ED9; phim &#x111;&#x1EBF;n m&#x1EE9;c n&#xE0;o?</p>
<p>Hay c&#xF3; th&#x1EC3; h&#x1ECF;i ng&#x1B0;&#x1EE3;c l&#x1EA1;i: m&#x1ED9;t b&#x1ED9; phim nh&#x1B0; th&#x1EBF; n&#xE0;o &#x111;&#x1EC3; m&#x1ED9;t ng&#x1B0;&#x1EDD;i c&#xF3; th&#x1EC3; y&#xEA;u &#x111;&#x1EBF;n th&#x1EBF;?</p>
<p>T&#xF4;i vi&#x1EBF;t nh&#x1EEF;ng d&#xF2;ng n&#xE0;y gi&#x1EEF;a nh&#x1EEF;ng giai &#x111;i&#x1EC7;u b&#x1EA3;n soundtrack &#x201C;The Ice Sculpture&#x201D;, b&#x1EA3;n nh&#x1EA1;c d&#x1ECB;u d&#xE0;ng c&#x1EE7;a m&#x1ED9;t trong nh&#x1EEF;ng c&#x1EA3;nh &#x111;&#x1EB9;p nh&#x1EA5;t trong phim. Rita ng&#x1ED3;i gi&#x1EEF;a con ph&#x1ED1; &#x111;&#xEA;m l&#x1EA1;nh l&#x1EBD;o m&#xF9;a &#x111;&#xF4;ng, ch&#x1EDD; &#x111;&#x1EE3;i. C&#xF4; &#x111;&#xE3; &#x201C;mua&#x201D; &#x111;&#x1B0;&#x1EE3;c Phil trong bu&#x1ED5;i &#x111;&#x1EA5;u gi&#xE1; b&#x1EB1;ng t&#x1EA5;t c&#x1EA3; s&#x1ED1; ti&#x1EC1;n c&#xF4; c&#xF3; v&#xE0; anh &#x111;ang t&#x1EB7;ng c&#xF4; m&#x1ED9;t b&#x1EE9;c &#x111;i&#xEA;u kh&#x1EAF;c b&#x103;ng. Rita, v&#x1EDB;i g&#x1B0;&#x1A1;ng m&#x1EB7;t &#x1EED;ng h&#x1ED3;ng v&#xE0; n&#x1EE5; c&#x1B0;&#x1EDD;i h&#x1EA1;nh ph&#xFA;c, n&#xF3;i r&#x1EB1;ng c&#xF4; &#x111;ang ch&#x1EBF;t c&#xF3;ng &#x111;&#xE2;y. Phil h&#xE0;i h&#x1B0;&#x1EDB;c n&#xF3;i r&#x1EB1;ng anh mu&#x1ED1;n x&#x1EE9;ng &#x111;&#xE1;ng v&#x1EDB;i t&#x1EEB;ng &#x111;&#x1ED3;ng xu c&#xF4; b&#x1ECF; ra. Khi anh quay b&#x1EE9;c t&#x1B0;&#x1EE3;ng l&#x1EA1;i, c&#xF4; n&#xF3;i &#x201C;Th&#x1EAD;t tuy&#x1EC7;t di&#x1EC7;u&#x201D; r&#x1ED3;i quay l&#x1EA1;i nh&#xEC;n anh, x&#xFA;c &#x111;&#x1ED9;ng, &#x111;&#xF4;i m&#x1EAF;t c&#xF4; c&#xF3; m&#x1ED9;t th&#x1EE9; &#xE1;nh s&#xE1;ng n&#xE0;o &#x111;&#xF3;. &#x201C;L&#xE0;m sao anh l&#xE0;m &#x111;&#x1B0;&#x1EE3;c &#x111;i&#x1EC1;u n&#xE0;y?&#x201D;, Rita h&#x1ECF;i.</p>
<p>&#x201C;Anh nh&#x1EDB; nh&#x1EEF;ng &#x111;&#x1B0;&#x1EDD;ng n&#xE9;t tr&#xEA;n g&#x1B0;&#x1A1;ng m&#x1EB7;t em r&#xF5; &#x111;&#x1EBF;n m&#x1EE9;c, anh c&#xF3; th&#x1EC3; l&#xE0;m n&#xF3; v&#x1EDB;i &#x111;&#xF4;i m&#x1EAF;t anh nh&#x1EAF;m l&#x1EA1;i.&#x201D;</p>
<p>V&#xE0; tuy&#x1EBF;t r&#x1A1;i. T&#xF4;i t&#x1B0;&#x1EDF;ng t&#x1B0;&#x1EE3;ng c&#x1EA3;nh phim n&#xE0;y c&#xF3; th&#x1EC3; s&#x1EBF;n s&#xFA;a &#x111;&#x1EBF;n m&#x1EE9;c n&#xE0;o, n&#x1EBF;u kh&#xF4;ng ph&#x1EA3;i l&#xE0; Bill Murray, n&#x1EBF;u kh&#xF4;ng ph&#x1EA3;i l&#xE0; McDowell, n&#x1EBF;u kh&#xF4;ng ph&#x1EA3;i d&#x1B0;&#x1EDB;i b&#xE0;n tay c&#x1EE7;a &#x111;&#x1EA1;o di&#x1EC5;n Harold Ramis, m&#xE0; Bill &#x111;&#xE3; c&#x1ED9;ng t&#xE1;c trong hai ph&#x1EA7;n Ghost Buster. Kho&#x1EA3;nh kh&#x1EAF;c &#x111;&#xF3; di&#x1EC5;n ra gi&#x1EA3;n d&#x1ECB;, t&#x1EF1; nhi&#xEA;n v&#xE0; &#x111;&#x1EA7;y c&#x1EA3;m x&#xFA;c, Rita h&#x1EA1;nh ph&#xFA;c v&#xE0; s&#xE1;ng ng&#x1EDD;i, c&#xF2;n Phil &#x111;&#x1EE9;ng &#x111;&#xE2;u &#x111;&#xF3; gi&#x1EEF;a y&#xEA;u th&#x1B0;&#x1A1;ng v&#xE0; &#x111;au kh&#x1ED5;. &#x110;&#xF4;i m&#x1EAF;t anh th&#x1EA5;m &#x111;&#x1B0;&#x1EE3;m n&#x1ED7;i bu&#x1ED3;n, v&#xEC; anh bi&#x1EBF;t kho&#x1EA3;nh kh&#x1EAF;c n&#xE0;y s&#x1EBD; qua. V&#xE0; s&#xE1;ng h&#xF4;m sau, &#x201C;ng&#xE0;y h&#xF4;m nay&#x201D; s&#x1EBD; tr&#x1EDF; l&#x1EA1;i v&#xE0; Rita s&#x1EBD; kh&#xF4;ng c&#xF2;n nh&#x1EDB; g&#xEC; n&#x1EEF;a.</p>
<p>&#x110;&#xF3; l&#xE0; t&#xEC;nh c&#x1EA3;nh m&#xE0; anh m&#x1EAF;c ph&#x1EA3;i &#x1EDF; Punxsutawney, m&#x1ED9;t ng&#xF4;i l&#xE0;ng nh&#x1ECF; ph&#xED;a T&#xE2;y bang Pennsylvania. &#x1EDE; &#x111;&#xE2;y, ng&#xE0;y 2 th&#xE1;ng 2 m&#x1ED7;i n&#x103;m &#x111;&#x1B0;&#x1EE3;c g&#x1ECD;i l&#xE0; &#x201C;Ng&#xE0;y chu&#x1ED9;t ch&#x169;i&#x201D;. Ng&#x1B0;&#x1EDD;i d&#xE2;n s&#x1EBD; t&#x1EE5; t&#x1EAD;p l&#x1EA1;i xem ng&#xE0;i th&#x1ECB; tr&#x1B0;&#x1EDF;ng &#x201C;g&#xF5; c&#x1EED;a&#x201D; v&#xE0; xem b&#xF3;ng c&#x1EE7;a ch&#xFA; chu&#x1ED9;t Phil. N&#x1EBF;u ch&#xFA; ta th&#x1EA5;y chi&#x1EBF;c b&#xF3;ng c&#x1EE7;a m&#xEC;nh, ngh&#x129;a l&#xE0; m&#xF9;a &#x111;&#xF4;ng s&#x1EBD; d&#xE0;i th&#xEA;m 6 tu&#x1EA7;n. N&#x1EBF;u kh&#xF4;ng, m&#xF9;a xu&#xE2;n s&#x1EBD; &#x111;&#x1EBF;n s&#x1EDB;m. L&#xE0; m&#x1ED9;t ph&#xF3;ng vi&#xEA;n th&#x1EDD;i ti&#x1EBF;t, Phil Connor b&#x1EAF;t bu&#x1ED9;c ph&#x1EA3;i &#x111;&#x1EBF;n &#x111;&#xE2;y h&#xE0;ng n&#x103;m &#x111;&#x1EC3; &#x111;&#x1B0;a tin. Kh&#xF4;ng bi&#x1EBF;t c&#xF3; ph&#x1EA3;i v&#xEC; tr&#xF9;ng t&#xEA;n v&#x1EDB;i m&#x1ED9;t con g&#x1EB7;m nh&#x1EA5;m n&#x1ED5;i ti&#x1EBF;ng hay kh&#xF4;ng, Phil gh&#xE9;t cay gh&#xE9;t &#x111;&#x1EAF;ng n&#x1A1;i n&#xE0;y.</p>
<p>Nh&#x1B0;ng &#x201C;Ng&#xE0;y chu&#x1ED9;t ch&#x169;i&#x201D; c&#xF3; l&#x1EBD; kh&#xF4;ng ph&#x1EA3;i &#x111;i&#x1EC1;u duy nh&#x1EA5;t khi&#x1EBF;n Phil th&#x1EA5;y kh&#xF3; ch&#x1ECB;u. B&#x1EDF;i anh ta l&#xE0; m&#x1ED9;t k&#x1EBB; g&#xE0;n d&#x1EDF; v&#xE0; &#xED;ch k&#x1EF7;, theo l&#x1EDD;i tay quay phim Larry (Christ Elliott) n&#xF3;i v&#x1EDB;i Rita. C&#xF4; l&#xE0; bi&#xEA;n t&#x1EAD;p vi&#xEA;n m&#x1EDB;i v&#x1EC1; &#x111;&#xE0;i v&#xE0; &#x111;&#x1B0;&#x1EE3;c ph&#xE2;n c&#xF4;ng &#x111;i c&#xF9;ng. Phil li&#xEA;n t&#x1EE5;c m&#x1EC9;a mai c&#x1EA3; hai trong chuy&#x1EBF;n &#x111;i, v&#xE0; kh&#xF4;ng ng&#x1EA1;i t&#x1ECF; ra m&#xEC;nh &#x111;&#xE1;ng gh&#xE9;t. Nh&#x1B0;ng kh&#xF4;ng ch&#x1EC9; khinh kh&#x1EC9;nh &#x111;&#x1ED3;ng nghi&#x1EC7;p, Phil d&#x1ECB; &#x1EE9;ng v&#x1EDB;i t&#x1EA5;t c&#x1EA3; m&#x1ECD;i ng&#x1B0;&#x1EDD;i. T&#x1EEB; b&#xE0; ch&#x1EE7; kh&#xE1;ch s&#x1EA1;n, &#x111;&#x1EBF;n v&#x1ECB; kh&#xE1;ch g&#x1EB7;p &#x1EDF; c&#x1EA7;u thang, anh b&#x1EA1;n c&#x169; b&#xE1;n b&#x1EA3;o hi&#x1EC3;m, t&#x1EA5;t c&#x1EA3;. Khi Rita khen ng&#x1EE3;i s&#x1EF1; h&#xE0;o h&#x1EE9;ng v&#xE0; n&#x1ED3;ng nhi&#x1EC7;t c&#x1EE7;a ng&#x1B0;&#x1EDD;i d&#xE2;n, Phil nh&#x103;n m&#x1EB7;t n&#xF3;i &#x201C;L&#x169; nh&#xE0; qu&#xEA; &#x1EA5;y m&#xE0;&#x201D;. Phil ch&#x1EC9; mu&#x1ED1;n bi&#x1EBF;n kh&#x1ECF;i &#x111;&#xE2;y. Khi c&#x1A1;n b&#xE3;o &#x111;&#x1EBF;n v&#xE0; ch&#x1EB7;n &#x111;&#x1EE9;ng &#x111;&#x1B0;&#x1EDD;ng tr&#x1EDF; v&#x1EC1;, anh ta ph&#xE0;n n&#xE0;n v&#x1EDB;i vi&#xEA;n c&#x1EA3;nh s&#xE1;t. &#x201C;Anh kh&#xF4;ng xem d&#x1EF1; b&#xE1;o th&#x1EDD;i ti&#x1EBF;t &#xE0;?&#x201D;, vi&#xEA;n c&#x1EA3;nh s&#xE1;t h&#x1ECF;i. &#x201C;T&#xF4;i &#x2018;&#x111;&#x1EBB;&#x2019; ra c&#xE1;i d&#x1EF1; b&#xE1;o c&#x1EE7;a anh ch&#x1EE9; &#x111;&#xE2;u&#x201D;. Anh ta ngh&#x129; m&#xEC;nh th&#xF4;ng minh h&#x1A1;n m&#x1ECD;i ng&#x1B0;&#x1EDD;i &#x1EDF; ng&#xF4;i l&#xE0;ng qu&#xEA; m&#xF9;a n&#xE0;y.</p>
<p>Nh&#x1B0;ng &#x111;i&#x1EC1;u k&#x1EF3; l&#x1EA1; x&#x1EA3;y &#x111;&#x1EBF;n. S&#xE1;ng h&#xF4;m sau, Phil th&#x1EE9;c gi&#x1EA5;c v&#xE0; c&#x1EA3;m th&#x1EA5;y quen thu&#x1ED9;c. Ch&#x1B0;&#x1A1;ng tr&#xEC;nh Radio ph&#xE1;t gi&#x1ED1;ng y h&#x1EC7;t h&#xF4;m tr&#x1B0;&#x1EDB;c, v&#x1EAB;n hai anh ch&#xE0;ng DJ &#x111;ang &#x111;&#xF9;a gi&#x1EE1;n c&#xF9;ng b&#x1EA3;n nh&#x1EA1;c &#x201C;I got you babe&#x201D; c&#x1EE7;a Sonny v&#xE0; Cher. Phil m&#x1EDF; c&#x1EED;a s&#x1ED5; v&#xE0; nh&#xEC;n th&#x1EA5;y khung c&#x1EA3;nh l&#xE0; c&#x1EE7;a ng&#xE0;y h&#xF4;m qua. &#x110;&#xE2;y l&#xE0; l&#xFA;c c&#xE2;u chuy&#x1EC7;n b&#x1EAF;t &#x111;&#x1EA7;u. Ch&#xFA;a, hay ai &#x111;&#xF3;, &#x111;&#xE3; tr&#x1EEB;ng ph&#x1EA1;t th&#xE1;i &#x111;&#x1ED9; c&#x1EE7;a Phil b&#x1EB1;ng c&#xE1;ch b&#x1EAF;t anh ph&#x1EA3;i s&#x1ED1;ng l&#x1EA1;i ng&#xE0;y anh ch&#xE1;n gh&#xE9;t nh&#x1EA5;t, &#x1EDF; n&#x1A1;i anh ch&#xE1;n gh&#xE9;t nh&#x1EA5;t, m&#xE3;i m&#xE3;i. D&#xF9; Phil c&#xF3; l&#xE0;m g&#xEC; &#x111;i n&#x1EEF;a, khi &#x111;&#x1ED3;ng h&#x1ED3; &#x111;i&#x1EC3;m 6 gi&#x1EDD; s&#xE1;ng, m&#x1ECD;i th&#x1EE9; &#x111;&#x1EC1;u quay tr&#x1EDF; l&#x1EA1;i &#x201C;Ng&#xE0;y chu&#x1ED9;t ch&#x169;i&#x201D; m&#x1ED9;t l&#x1EA7;n n&#x1EEF;a.</p>
<p>N&#x1EBF;u l&#xE0; b&#x1EA1;n, b&#x1EA1;n s&#x1EBD; l&#xE0;m g&#xEC; trong t&#xEC;nh c&#x1EA3;nh c&#x1EE7;a Phil? Bi&#xEA;n k&#x1ECB;ch Danny Rubin &#x111;&#xE3; kh&#xE9;o l&#xE9;o d&#x1EAB;n d&#x1EAF;t c&#xE2;u chuy&#x1EC7;n theo &#x111;&#xFA;ng c&#xE1;ch m&#xE0; ch&#xFA;ng ta t&#x1B0;&#x1EDF;ng t&#x1B0;&#x1EE3;ng. Ai c&#x169;ng d&#x1EC5; d&#xE0;ng nh&#x1EAD;n ra, s&#x1ED1;ng m&#xE3;i c&#xF9;ng m&#x1ED9;t ng&#xE0;y &#x111;&#x1ED3;ng ngh&#x129;a v&#x1EDB;i s&#x1EF1; b&#x1EA5;t t&#x1EED; v&#xE0; t&#x1EF1; do. Phil c&#xF3; th&#x1EC3; l&#xE0;m b&#x1EA5;t c&#x1EE9; &#x111;i&#x1EC1;u g&#xEC; anh ta mu&#x1ED1;n m&#xE0; kh&#xF4;ng s&#x1EE3; h&#x1EAD;u qu&#x1EA3;. Anh c&#xF3; th&#x1EC3; &#x103;n t&#x1EA5;t c&#x1EA3; &#x111;&#x1ED3; ng&#x1ECD;t &#x1B0;a th&#xED;ch, t&#xED;nh to&#xE1;n &#x111;&#x1EC3; tr&#x1ED9;m ti&#x1EC1;n v&#xE0; tr&#x1EDF; th&#xE0;nh &#x111;&#x1EA1;i gia (n&#x1EBF;u b&#x1ECB; b&#x1EAF;t ch&#x1EC9; c&#x1EA7;n ch&#x1EDD; &#x111;&#x1EBF;n h&#xF4;m sau), c&#x1B0;a c&#x1EA9;m v&#xE0; ng&#x1EE7; v&#x1EDB;i m&#x1ECD;i c&#xF4; g&#xE1;i trong l&#xE0;ng&#x2026; Nh&#x1B0;ng nh&#x1EEF;ng ni&#x1EC1;m vui &#x1EA5;y s&#x1EDB;m qua nhanh, &#x111;&#x1EC3; l&#x1EA1;i n&#x1ED7;i ch&#xE1;n ch&#x1B0;&#x1EDD;ng v&#xE0; m&#x1EC7;t m&#x1ECF;i. M&#x1ECD;i &#x111;i&#x1EC1;u anh ta l&#xE0;m, nh&#x1EEF;ng ng&#x1B0;&#x1EDD;i &#x111;&#xE3; g&#x1EB7;p, nh&#x1EEF;ng g&#xEC; &#x111;&#xE3; di&#x1EC5;n ra, &#x111;&#x1EC1;u b&#x1ECB; x&#xF3;a s&#x1EA1;ch s&#x1EBD; v&#xE0;o s&#xE1;ng h&#xF4;m sau.</p>
<p>Vi&#x1EC7;c s&#x1ED1;ng &#x111;i s&#x1ED1;ng l&#x1EA1;i c&#xF9;ng m&#x1ED9;t ng&#xE0;y ch&#x1EC9; l&#xE0; c&#xE1;i n&#x1EC1;n cho m&#x1ED9;t &#x111;i&#x1EC1;u l&#x1EDB;n lao h&#x1A1;n, &#x111;&#x1ED1;i v&#x1EDB;i Phil, &#x111;&#xF3; l&#xE0; s&#x1EF1; thay &#x111;&#x1ED5;i. C&#xF3; m&#x1ED9;t l&#xFD; do n&#xE0;o &#x111;&#xF3; &#x111;&#x1EC3; anh b&#x1ECB; k&#x1EB9;t l&#x1EA1;i, v&#xE0; ch&#x1EAF;c ch&#x1EAF;n s&#x1EBD; c&#xF3; m&#x1ED9;t l&#xFD; do &#x111;&#x1EC3; gi&#x1EA3;i tho&#xE1;t anh, v&#xE0; t&#xF4;i ch&#x1EDD; &#x111;&#x1EE3;i. Ch&#x1EC9; c&#xF3; th&#x1EC3; l&#xE0; t&#xEC;nh y&#xEA;u, t&#xF4;i &#x111;&#xE3; ngh&#x129; th&#x1EBF;, v&#xE0; Rita xu&#x1EA5;t hi&#x1EC7;n. Khi &#x111;&#xE3; c&#xF3; th&#x1EDD;i gian, Phil b&#x1EAF;t &#x111;&#x1EA7;u nh&#xEC;n m&#x1ECD;i ng&#x1B0;&#x1EDD;i xung quanh m&#x1ED9;t c&#xE1;ch r&#xF5; r&#xE0;ng h&#x1A1;n, anh nh&#xEC;n th&#x1EA5;y c&#xF4;. Ban &#x111;&#x1EA7;u ch&#x1EC9; l&#xE0; t&#xE1;n t&#x1EC9;nh, sau nhi&#x1EC1;u n&#x1ED7; l&#x1EF1;c v&#xE0; m&#xE1;nh kh&#xF3;e, Phil &#x111;&#xE3; c&#xF3; th&#x1EC3; b&#x1EAF;t chuy&#x1EC7;n v&#xE0; h&#x1EB9;n h&#xF2; v&#x1EDB;i Rita. Khi d&#xE0;nh nhi&#x1EC1;u th&#x1EDD;i gian &#x111;&#x1EBF;n th&#x1EBF; cho m&#x1ED9;t ng&#x1B0;&#x1EDD;i, Phil d&#x1EA7;n hi&#x1EC3;u v&#xE0; y&#xEA;u Rita. C&#xF4; t&#x1ED1;t b&#x1EE5;ng, t&#x1EED; t&#x1EBF;, y&#xEA;u v&#x103;n ch&#x1B0;&#x1A1;ng, c&#xF3; m&#x1ED9;t n&#x1EE5; c&#x1B0;&#x1EDD;i r&#x1EA1;ng r&#x1EE1; v&#xE0; t&#xE2;m h&#x1ED3;n &#x111;&#x1EB9;p. C&#xF4; gi&#x1ED1;ng nh&#x1B0; m&#x1ED9;t thi&#xEA;n th&#x1EA7;n. Ng&#x1B0;&#x1EE3;c h&#x1EB3;n v&#x1EDB;i Phil. Anh t&#xEC;m c&#xE1;ch &#x111;&#x1EC3; khi&#x1EBF;n c&#xF4; y&#xEA;u anh, nh&#x1B0;ng lu&#xF4;n th&#x1EA5;t b&#x1EA1;i. &#x110;&#xF3; l&#xE0; l&#xFA;c anh nh&#x1EAD;n ra t&#xEC;nh y&#xEA;u kh&#xF4;ng ph&#x1EA3;i th&#x1EE9; c&#xF3; &#x111;&#x1B0;&#x1EE3;c b&#x1EB1;ng s&#x1EF1; gi&#x1EA3; d&#x1ED1;i, d&#xF9; c&#xF3; th&#x1EED; bao nhi&#xEA;u l&#x1EA7;n &#x111;i n&#x1EEF;a.</p>
<p>T&#xF4;i y&#xEA;u nh&#x1EEF;ng b&#x1ED9; phim v&#x1EC1; s&#x1EF1; thay &#x111;&#x1ED5;i c&#x1EE7;a m&#x1ED9;t con ng&#x1B0;&#x1EDD;i. M&#x1ED9;t ph&#x1EA7;n, v&#xEC; &#x111;&#xF3; l&#xE0; &#x111;i&#x1EC1;u t&#xF4;i hi&#x1EBF;m khi l&#xE0;m &#x111;&#x1B0;&#x1EE3;c. Ph&#x1EA7;n kh&#xE1;c, n&#xF3; mang l&#x1EA1;i ni&#x1EC1;m tin r&#x1EB1;ng con ng&#x1B0;&#x1EDD;i, d&#xF9; b&#x1EA5;t k&#x1EF3; ai, lu&#xF4;n c&#xF3; th&#x1EC3; tr&#x1EDF; n&#xEA;n t&#x1ED1;t &#x111;&#x1EB9;p h&#x1A1;n. C&#xE2;u h&#x1ECF;i m&#xE0; bi&#xEA;n k&#x1ECB;ch Rubin &#x111;&#x1EB7;t ra khi vi&#x1EBF;t <em>Groundhog Day</em> l&#xE0;, li&#x1EC7;u m&#x1ED9;t ng&#x1B0;&#x1EDD;i s&#x1EBD; nh&#x1B0; th&#x1EBF; n&#xE0;o n&#x1EBF;u anh ta &#x111;&#x1B0;&#x1EE3;c s&#x1ED1;ng b&#x1EA5;t t&#x1EED;? T&#x1EA5;t nhi&#xEA;n, anh ta s&#x1EBD; sa &#x111;&#x1ECD;a, s&#x1EBD; h&#x1B0; h&#x1ECF;ng, s&#x1EBD; th&#x1ECF;a m&#xE3;n t&#x1EA5;t c&#x1EA3; nh&#x1EEF;ng l&#x1EA1;c th&#xFA; m&#xE0; b&#xEC;nh th&#x1B0;&#x1EDD;ng anh ta kh&#xF4;ng c&#xF3; &#x111;&#x1B0;&#x1EE3;c. Nh&#x1B0;ng cho &#x111;&#x1EBF;n cu&#x1ED1;i c&#xF9;ng, t&#x1EA5;t c&#x1EA3; ch&#xFA;ng ta &#x111;&#x1EC1;u s&#x1EBD; nh&#x1B0; Phil, tr&#x1EDF; v&#x1EC1; v&#x1EDB;i b&#x1EA3;n ch&#x1EA5;t c&#x1A1; b&#x1EA3;n nh&#x1EA5;t c&#x1EE7;a con ng&#x1B0;&#x1EDD;i: y&#xEA;u th&#x1B0;&#x1A1;ng v&#xE0; h&#x1ECD;c h&#x1ECF;i. &#x110;&#xF3; l&#xE0; hai &#x111;i&#x1EC1;u s&#x1EBD; gi&#xFA;p ch&#xFA;ng ta s&#x1ED1;ng m&#xE3;i qua nh&#x1EEF;ng th&#xE1;ng n&#x103;m b&#x1EA5;t t&#x1EAD;n. &#x110;&#xF3; l&#xE0; &#x111;i&#x1EC1;u khi&#x1EBF;n ni&#x1EC1;m vui s&#x1ED1;ng kh&#xF4;ng bao gi&#x1EDD; c&#x1EA1;n.</p>
<p>Phil h&#x1ECD;c c&#xE1;ch &#x111;&#x1EC3; y&#xEA;u th&#x1B0;&#x1A1;ng, kh&#xF4;ng ch&#x1EC9; Rita m&#xE0; t&#x1EA5;t c&#x1EA3; nh&#x1EEF;ng ng&#x1B0;&#x1EDD;i d&#xE2;n trong th&#x1ECB; tr&#x1EA5;n. Anh c&#xF3; th&#x1EDD;i gian &#x111;&#x1EC3; g&#x1EB7;p h&#x1ECD;, bi&#x1EBF;t h&#x1ECD;, hi&#x1EC3;u h&#x1ECD;. Anh b&#x1EAF;t &#x111;&#x1EA7;u hi&#x1EC3;u nh&#x1EEF;ng gi&#xE1; tr&#x1ECB; kh&#xE1;c c&#x1EE7;a cu&#x1ED9;c s&#x1ED1;ng, &#x111;i&#x1EC1;u khi&#x1EBF;n t&#xF4;i b&#x1EA5;t ng&#x1EDD; &#x1EDF; l&#x1EA7;n &#x111;&#x1EA7;u xem phim. T&#xF4;i ng&#x1EE1; r&#x1EB1;ng t&#xEC;nh y&#xEA;u s&#x1EBD; c&#x1EE9;u gi&#xFA;p Phil, nh&#x1B0;ng kh&#xF4;ng ph&#x1EA3;i, kh&#xF4;ng ch&#x1EC9; c&#xF3; th&#x1EBF;. Anh &#x111;ang d&#x1EA7;n y&#xEA;u ch&#xED;nh n&#x1A1;i anh t&#x1EEB;ng gh&#xE9;t, y&#xEA;u nh&#x1EEF;ng con ng&#x1B0;&#x1EDD;i anh t&#x1EEB;ng gh&#xE9;t, v&#xE0; hi&#x1EC3;u ra &#xFD; ngh&#x129;a c&#x1EE7;a m&#x1ED9;t ng&#xE0;y l&#x1EC5; anh &#x111;&#x1EBF;n h&#xE0;ng n&#x103;m nh&#x1B0;ng ch&#x1B0;a bao gi&#x1EDD; hi&#x1EC3;u. Anh gi&#xFA;p &#x111;&#x1EE1; c&#x1EE5; gi&#xE0; &#x103;n xin, &#x1EDF; b&#xEA;n c&#x1EE5; &#x111;&#x1EC3; bi&#x1EBF;t r&#x1EB1;ng &#x111;&#xF3; l&#xE0; ng&#xE0;y cu&#x1ED1;i c&#xF9;ng c&#x1EE5; s&#x1ED1;ng, kh&#xF4;ng th&#x1EC3; thay &#x111;&#x1ED5;i. M&#x1ED7;i &#x111;&#x1ED3;ng ti&#x1EC1;n l&#x1EBB; hay m&#x1ED9;t b&#x1EEF;a c&#x1A1;m ngon v&#x1EDB;i c&#x1EE5;, l&#xE0; m&#x1ED9;t &#xE2;n hu&#x1EC7; cu&#x1ED1;i &#x111;&#x1EDD;i m&#xE0; anh &#x111;&#xE3; th&#x1EDD; &#x1A1; b&#x1ECF; qua. Phil h&#x1ECD;c &#x111;&#x1B0;&#x1EE3;c c&#xE1;ch quan t&#xE2;m th&#x1EF1;c s&#x1EF1;, v&#xEC; anh &#x111;&#xE3; bi&#x1EBF;t cu&#x1ED9;c s&#x1ED1;ng mong manh &#x111;&#x1EBF;n th&#x1EBF; n&#xE0;o. M&#x1ED7;i con ng&#x1B0;&#x1EDD;i trong ng&#xF4;i l&#xE0;ng, gi&#x1ED1;ng nh&#x1B0; c&#x1EE5; gi&#xE0;, kh&#xF4;ng c&#xF2;n l&#xE0; nh&#x1EEF;ng ng&#x1B0;&#x1EDD;i &#x201C;qu&#xEA; m&#xF9;a ng&#x1ED1;c ngh&#x1EBF;ch&#x201D; n&#x1EEF;a. H&#x1ECD; c&#xF3; t&#xEC;nh c&#x1EA3;m, c&#xF3; v&#x1EA5;n &#x111;&#x1EC1;, c&#xF3; r&#x1EAF;c r&#x1ED1;i, trong m&#x1ED9;t ng&#xE0;y, h&#x1ECD; c&#xF3; th&#x1EC3; ch&#x1EBF;t, g&#xE3;y ch&#xE2;n v&#xEC; t&#xE9; c&#xE2;y, l&#x1EE7;ng b&#xE1;nh xe, m&#x1EAF;c ngh&#x1EB9;n, &#x111;au l&#x1B0;ng&#x2026; Phil s&#x1ED1;ng &#x111;&#x1EE7; l&#xE2;u v&#x1EDB;i h&#x1ECD; &#x111;&#x1EC3; tr&#x1EDF; th&#xE0;nh ng&#x1B0;&#x1EDD;i th&#xE2;n c&#x1EE7;a h&#x1ECD;, v&#xE0; anh y&#xEA;u h&#x1ECD; v&#x1EDB;i nh&#x1EEF;ng &#x111;i&#x1EC1;u b&#xEC;nh d&#x1ECB; &#x111;&#x1EB9;p &#x111;&#x1EBD; &#x1EA5;y. Anh hi&#x1EC3;u ra r&#x1EB1;ng, &#x201C;Ng&#xE0;y chu&#x1ED9;t ch&#x169;i&#x201D; kh&#xF4;ng ph&#x1EA3;i ch&#x1EC9; l&#xE0; m&#x1ED9;t d&#x1ECB;p l&#x1EC5; v&#x1EDB;i tr&#xF2; ng&#x1EDB; ng&#x1EA9;n, m&#xE0; ch&#x1EE9;a &#x111;&#x1EF1;ng hi v&#x1ECD;ng v&#xE0; s&#x1EE9;c s&#x1ED1;ng c&#x1EE7;a m&#x1ED7;i ng&#x1B0;&#x1EDD;i d&#xE2;n, r&#x1EB1;ng m&#xF9;a &#x111;&#xF4;ng c&#x169;ng c&#xF3; th&#x1EC3; tr&#x1EDF; n&#xEA;n &#x1EA5;m &#xE1;p b&#x1EDF;i t&#xEC;nh ng&#x1B0;&#x1EDD;i v&#xE0; s&#x1EF1; l&#x1EA1;c quan.</p>
<p>V&#xE0; r&#x1ED3;i, anh c&#xF3; &#x111;&#x1B0;&#x1EE3;c tr&#xE1;i tim c&#x1EE7;a Rita. M&#x1ED9;t c&#xE1;ch t&#x1EF1; nhi&#xEA;n nh&#x1EA5;t, anh tr&#x1EDF; th&#xE0;nh h&#xEC;nh m&#x1EAB;u l&#xFD; t&#x1B0;&#x1EDF;ng c&#xF4; t&#x1EEB;ng m&#x1ED9;ng m&#x1A1;, m&#xE0; kh&#xF4;ng h&#x1EC1; c&#xF3; ch&#x1EE7; &#x111;&#xED;ch. Th&#x1EAD;t kh&#xF3; &#x111;&#x1EC3; kh&#xF4;ng c&#x1EA3;m th&#x1EA5;y ngu&#x1ED3;n c&#x1EA3;m h&#x1EE9;ng &#x111;&#xF3;, khi ch&#x1EE9;ng ki&#x1EBF;n Phil h&#x1ECD;c Piano, h&#x1ECD;c &#x111;i&#xEA;u kh&#x1EAF;c, &#x111;&#x1ECD;c s&#xE1;ch, tr&#x1EDF; th&#xE0;nh m&#x1ED9;t con ng&#x1B0;&#x1EDD;i m&#x1EDB;i. T&#x1EEB; m&#x1ED9;t g&#xE3; kh&#x1ED1;n ban &#x111;&#x1EA7;u, anh th&#xE0;nh ng&#x1B0;&#x1EDD;i trong m&#x1ED9;ng c&#x1EE7;a Rita, m&#x1ED9;t ng&#x1B0;&#x1EDD;i t&#x1ED1;t b&#x1EE5;ng, lu&#xF4;n gi&#xFA;p &#x111;&#x1EE1; m&#x1ECD;i ng&#x1B0;&#x1EDD;i &#x2013; m&#x1ED9;t ai &#x111;&#xF3; tr&#xE1;i ng&#x1B0;&#x1EE3;c h&#x1EB3;n v&#x1EDB;i anh &#x1EDF; &#x111;&#x1EA7;u phim. Khi quay phim n&#xE0;y, m&#x1ED7;i khi &#x111;&#x1EA1;o di&#x1EC5;n Ramis gi&#x1EA3;i th&#xED;ch m&#x1ED9;t c&#x1EA3;nh quay, Bill Murray th&#x1B0;&#x1EDD;ng h&#x1ECF;i l&#x1EA1;i: &#x201C;V&#x1EAD;y l&#xE0; Phil t&#x1ED1;t hay Phil x&#x1EA5;u?&#x201D;. Ban &#x111;&#x1EA7;u, v&#x1ECB; &#x111;&#x1EA1;o di&#x1EC5;n c&#x169;ng &#x111;ang c&#xE2;n nh&#x1EAF;c r&#x1EA5;t nhi&#x1EC1;u di&#x1EC5;n vi&#xEA;n cho vai Phil, c&#xF3; c&#x1EA3; Tom Hank hay John Travolta, nh&#x1B0;ng t&#x1EEB; ch&#x1ED1;i v&#xEC; &#x201C;h&#x1ECD; tr&#xF4;ng qu&#xE1; t&#x1ED1;t&#x201D;. Bill c&#xF3; &#x111;&#x1EE7; c&#x1EA3; hai th&#xE1;i c&#x1EF1;c cho s&#x1EF1; thay &#x111;&#x1ED5;i, nh&#x1B0;ng &#x111;i&#x1EC1;u thuy&#x1EBF;t ph&#x1EE5;c trong phim, ch&#xFA;ng ta nh&#x1EAD;n ra &#x111;&#xF3; v&#x1EAB;n l&#xE0; Phil. Kh&#xF4;ng ph&#x1EA3;i l&#xE0; m&#x1ED9;t Phil kh&#xE1;c h&#x1EB3;n, m&#xE0; l&#xE0; m&#x1ED9;t Phil t&#x1ED1;t &#x111;&#x1EB9;p h&#x1A1;n. Anh mu&#x1ED1;n tr&#x1EDF; th&#xE0;nh ng&#x1B0;&#x1EDD;i t&#x1ED1;t v&#xE0; h&#x1ECD;c c&#xE1;ch tr&#x1EDF; th&#xE0;nh ng&#x1B0;&#x1EDD;i t&#x1ED1;t. &#x110;&#xF3; c&#x169;ng l&#xE0; &#x111;i&#x1EC1;u ch&#xFA;ng ta c&#xF3; th&#x1EC3; l&#xE0;m &#x111;&#x1B0;&#x1EE3;c, tr&#x1EDF; th&#xE0;nh m&#x1ED9;t &#x201C;ch&#xED;nh m&#xEC;nh&#x201D; ng&#xE0;y mai t&#x1ED1;t h&#x1A1;n h&#xF4;m nay.</p>
<p>Gi&#x1ED1;ng nh&#x1B0; l&#x1EDD;i c&#x1EE7;a anh ch&#xE0;ng m&#xEA; phim Robert Black, cu&#x1ED9;c s&#x1ED1;ng th&#x1EAD;t s&#x1EF1; c&#x169;ng kh&#xF4;ng kh&#xE1;c l&#x1EAF;m v&#x1EDB;i <em>Groundhog day</em>, khi ch&#xFA;ng ta &#x111;ang s&#x1ED1;ng &#x111;i s&#x1ED1;ng l&#x1EA1;i c&#xF9;ng m&#x1ED9;t ng&#xE0;y, ng&#xE0;y &#x201C;h&#xF4;m nay&#x201D;. V&#xE0; ch&#xFA;ng ta n&#xEA;n tr&#xE2;n tr&#x1ECD;ng m&#x1ED7;i kho&#x1EA3;nh kh&#x1EAF;c &#x111;ang c&#xF3;, v&#xEC; kh&#xF4;ng c&#x1EA7;n ph&#x1EA3;i h&#x1EE9;ng ch&#x1ECB;u m&#x1ED9;t l&#x1EDD;i nguy&#x1EC1;n nh&#x1B0; Phil, ch&#xFA;ng ta c&#x169;ng bi&#x1EBF;t r&#x1EB1;ng t&#x1EA5;t c&#x1EA3; s&#x1EBD; tr&#xF4;i qua. Nh&#x1B0;ng ch&#x1EC9; nh&#x1EEF;ng ng&#x1B0;&#x1EDD;i ngay khi tr&#x1EA3;i qua nh&#x1EEF;ng gi&#xE2;y ph&#xFA;t h&#x1EA1;nh ph&#xFA;c nh&#x1EA5;t, m&#xE0; v&#x1EAB;n mang trong l&#xF2;ng n&#x1ED7;i ti&#x1EBF;c nu&#x1ED1;i cho kho&#x1EA3;nh kh&#x1EAF;c n&#xF3; qua &#x111;i, m&#x1EDB;i l&#xE0; nh&#x1EEF;ng ng&#x1B0;&#x1EDD;i c&#x1EA3;m nh&#x1EAD;n &#x111;&#x1B0;&#x1EE3;c ni&#x1EC1;m h&#x1EA1;nh ph&#xFA;c tr&#x1ECD;n v&#x1EB9;n. T&#xF4;i nh&#x1EDB; &#x111;&#x1EBF;n m&#x1ED9;t v&#xE0;i d&#xF2;ng trong quy&#x1EC3;n s&#xE1;ch &#x201C;Plato v&#xE0; con th&#xFA; m&#x1ECF; v&#x1ECB;t b&#x1B0;&#x1EDB;c v&#xE0;o qu&#xE1;n bar&#x201D; v&#x1EEB;a &#x111;&#x1ECD;c xong m&#x1EA5;y ng&#xE0;y tr&#x1B0;&#x1EDB;c. T&#xE1;c gi&#x1EA3; n&#xF3;i v&#x1EC1; nh&#x1EEF;ng ng&#x1B0;&#x1EDD;i hi&#x1EC7;n sinh lu&#xF4;n suy ngh&#x129; v&#x1EC1; c&#xE1;i ch&#x1EBF;t, v&#xE0; cho r&#x1EB1;ng &#x111;&#xF3; c&#x169;ng l&#xE0; m&#x1ED9;t c&#xE1;ch s&#x1ED1;ng hay. S&#x1ED1;ng n&#xFA;p b&#xF3;ng c&#xE1;i ch&#x1EBF;t. &#x201C;&#x110;&#x1EC3; s&#x1ED1;ng &#x111;&#xED;ch th&#x1EF1;c, ch&#xFA;ng ta ph&#x1EA3;i &#x111;&#x1ED1;i m&#x1EB7;t v&#x1EDB;i s&#x1EF1; th&#x1EAD;t l&#xE0; ch&#xFA;ng ta s&#x1EBD; ph&#x1EA3;i ch&#x1EBF;t, v&#xE0; nh&#x1EAD;n l&#x1EA5;y tr&#xE1;ch nhi&#x1EC7;m s&#x1ED1;ng m&#x1ED9;t cu&#x1ED9;c &#x111;&#x1EDD;i &#xFD; ngh&#x129;a d&#x1B0;&#x1EDB;i b&#xF3;ng c&#xE1;i ch&#x1EBF;t&#x201D;. T&#x1B0;&#x1A1;ng t&#x1EF1; nh&#x1B0; nhau.</p>
<p>T&#xF4;i ch&#x1B0;a xem <em>Groundhog Day</em> nhi&#x1EC1;u nh&#x1B0; Black, nh&#x1B0;ng t&#xF4;i hi&#x1EC3;u v&#xEC; sao anh c&#xF3; th&#x1EC3; xem &#x111;i xem l&#x1EA1;i m&#xE3;i m&#x1ED9;t b&#x1ED9; phim m&#xE0; kh&#xF4;ng ch&#xE1;n. &#x110;&#xE2;y ch&#xED;nh l&#xE0; ki&#x1EC3;u phim nh&#x1B0; th&#x1EBF;, c&#x1ED5; v&#x169; cho nh&#x1EEF;ng &#x111;i&#x1EC1;u t&#x1ED1;t &#x111;&#x1EB9;p trong m&#x1ED7;i con ng&#x1B0;&#x1EDD;i, c&#x1ED5; v&#x169; s&#x1ED1;ng y&#xEA;u th&#x1B0;&#x1A1;ng, chan h&#xF2;a v&#xE0; nh&#xE2;n &#xE1;i v&#x1EDB;i &#x111;&#x1ED3;ng lo&#x1EA1;i, c&#x1ED5; v&#x169; ch&#xFA;ng ta ch&#xFA; &#xFD; v&#xE0; d&#xE0;nh th&#x1EDD;i gian nhi&#x1EC1;u h&#x1A1;n &#x111;&#x1EC3; hi&#x1EC3;u &#x111;&#x1B0;&#x1EE3;c h&#x1ECD;, c&#x1ED5; v&#x169; m&#x1ED7;i ng&#x1B0;&#x1EDD;i thay &#x111;&#x1ED5;i v&#xE0; ph&#xE1;t tri&#x1EC3;n kh&#x1EA3; n&#x103;ng b&#x1EA3;n th&#xE2;n m&#x1ED7;i ng&#xE0;y. B&#x1ED9; phim c&#xF2;n mang l&#x1EA1;i c&#x1EA3;m x&#xFA;c v&#x1EC1; t&#xEC;nh y&#xEA;u cu&#x1ED9;c s&#x1ED1;ng, ch&#xFA;ng ta c&#xF2;n mong g&#xEC; h&#x1A1;n n&#x1EEF;a? V&#x1EDB;i t&#xF4;i, t&#xF4;i &#x111;&#xE3; y&#xEA;u kh&#xF4;ng gian c&#x1ED5; k&#xED;nh c&#x1EE7;a nh&#x1EEF;ng b&#x1ED9; phim c&#x169; t&#x1EEB; tr&#x1B0;&#x1EDB;c, t&#xF4;i &#x111;ang y&#xEA;u nh&#x1EEF;ng giai &#x111;i&#x1EC7;u saxophone nh&#x1EB9; nh&#xE0;ng c&#x1EE7;a George Fenton, y&#xEA;u nh&#x1EEF;ng c&#x1EA3;nh phim &#x111;&#x1EB9;p v&#xE0; gi&#xE0;u c&#x1EA3;m x&#xFA;c, n&#xF3; khi&#x1EBF;n t&#xF4;i tin t&#x1B0;&#x1EDF;ng v&#xE0;o t&#xEC;nh y&#xEA;u v&#xE0; ni&#x1EC1;m h&#x1EA1;nh ph&#xFA;c, v&#xE0; t&#xF4;i s&#x1EBD; c&#xF2;n y&#xEA;u g&#xEC; n&#x1EEF;a &#x1EDF; b&#x1ED9; phim n&#xE0;y? T&#xF4;i s&#x1EBD; &#x111;&#x1EC3; d&#xE0;nh n&#xF3; cho m&#x1ED9;t &#x201C;h&#xF4;m nay&#x201D; kh&#xE1;c. Nh&#x1EEF;ng b&#x1ED9; phim hay, c&#x169;ng nh&#x1B0; nh&#x1EEF;ng quy&#x1EC3;n s&#xE1;ch hay, ch&#xFA;ng kh&#xF4;ng c&#xF3; tu&#x1ED5;i nh&#x1B0;ng s&#x1EBD; lu&#xF4;n l&#x1EDB;n l&#xEA;n theo ta, theo m&#x1ED7;i tr&#x1EA3;i nghi&#x1EC7;m v&#xE0; s&#x1EF1; tr&#x1B0;&#x1EDF;ng th&#xE0;nh ta c&#xF3; &#x111;&#x1B0;&#x1EE3;c.</p>
]]></content>
        <author>
            <name>Quoc Khanh</name>
            <email>khanhbq@innoteq.vn</email>
            <uri>https://khanhquoc.press/about</uri>
        </author>
    </entry>
    <entry>
        <title type="html"><![CDATA[Ngày đẹp trời]]></title>
        <id>https://khanhquoc.press/blog/ngay-dep-troi/</id>
        <link href="https://khanhquoc.press/blog/ngay-dep-troi/">
        </link>
        <updated>2018-06-25T17:00:00Z</updated>
        <summary type="html"><![CDATA[Tôi thích những ngày một mình, đi dạo trên đường, đôi khi lại nằm dài ra ghế, đọc những điều linh tinh, nhìn những thứ lãng mạn, nghĩ những điều vụn vặt.]]></summary>
        <content type="html"><![CDATA[<p>T&#xF4;i th&#xED;ch nh&#x1EEF;ng ng&#xE0;y m&#x1ED9;t m&#xEC;nh, &#x111;i d&#x1EA1;o tr&#xEA;n &#x111;&#x1B0;&#x1EDD;ng, &#x111;&#xF4;i khi l&#x1EA1;i n&#x1EB1;m d&#xE0;i ra gh&#x1EBF;, &#x111;&#x1ECD;c nh&#x1EEF;ng &#x111;i&#x1EC1;u linh tinh, nh&#xEC;n nh&#x1EEF;ng th&#x1EE9; l&#xE3;ng m&#x1EA1;n, ngh&#x129; nh&#x1EEF;ng &#x111;i&#x1EC1;u v&#x1EE5;n v&#x1EB7;t.</p>
<p>Ngh&#x129; v&#x1EC1; nh&#x1EEF;ng th&#x1EE9; ch&#x1EB3;ng &#x111;&#x1EA7;u ch&#x1EB3;ng cu&#x1ED1;i c&#x169;ng ch&#x1EB3;ng cao xa, m&#x1A1; nh&#x1EEF;ng th&#x1EE9; t&#x1EA7;m th&#x1B0;&#x1EDD;ng, th&#xE8;m l&#xE0;m nh&#x1EEF;ng &#x111;i&#x1EC1;u v&#x1EDB; v&#x1EA9;n.</p>
<p>T&#xF4;i th&#xED;ch nh&#x1EEF;ng ng&#xE0;y c&#xF3; th&#x1EC3; vui, c&#xF3; th&#x1EC3; bu&#x1ED3;n m&#xE0; kh&#xF4;ng c&#x1EA7;n quy&#x1EBF;t &#x111;&#x1ECB;nh tr&#x1B0;&#x1EDB;c. &#x110;i &#x111;&#xE2;u c&#x169;ng &#x111;&#x1B0;&#x1EE3;c, l&#xE0;m g&#xEC; c&#x169;ng &#x111;&#x1B0;&#x1EE3;c, ch&#x1EC9; l&#xE0; l&#xE0;m kh&#xE1;c &#x111;i nh&#x1EEF;ng th&#x1EE9; trong &#x111;&#x1EA7;u quy&#x1EBF;t &#x111;&#x1ECB;nh. &#x110;&#xF4;i khi ch&#x1EC9; l&#xE0; l&#xE0; s&#x1EF1; th&#xF4;i th&#xFA;c trong ng&#x1B0;&#x1EDD;i r&#x1EB1;ng ch&#x1EC9; m&#x1ED9;t ng&#xE0;y th&#xF4;i, l&#xFD; tr&#xED;, m&#xE0;y c&#x1EE9; ngh&#x1EC9; ng&#x1A1;i m&#x1ED9;t ch&#xFA;t, c&#xF2;n l&#x1EA1;i &#x111;&#x1EC3; tao lo.</p>
<p>T&#xF4;i c&#x169;ng th&#xED;ch nh&#x1EEF;ng ng&#xE0;y &#x111;&#x1B0;&#x1EE3;c t&#x1B0; l&#x1EF1; nh&#xEC;n ng&#x1EAF;m th&#x1EBF; gi&#x1EDD;i, nh&#xEC;n n&#xE0;y ng&#x1EAF;m kia. Nh&#xEC;n nh&#x1EEF;ng &#x111;i&#x1EC1;u b&#xEC;nh th&#x1B0;&#x1EDD;ng, ng&#x1EAF;m nh&#x1EEF;ng th&#x1EE9; gi&#x1EA3;n d&#x1ECB;. Nh&#xEC;n m&#x1ECD;i ng&#x1B0;&#x1EDD;i n&#x1EAF;m tay nhau, ng&#x1EAF;m h&#x1ECD; c&#x1B0;&#x1EDD;i v&#x1EDB;i nhau. Th&#x1EA5;y cu&#x1ED9;c s&#x1ED1;ng v&#x1EAB;n c&#x1EE9; b&#xEC;nh y&#xEA;n th&#x1EBF;, b&#xE3;o b&#xF9;ng trong l&#xF2;ng, r&#x1ED3;i th&#xEC; c&#x169;ng qua th&#xF4;i, vui v&#x1EBB; trong l&#xF2;ng, r&#x1ED3;i th&#xEC; c&#x169;ng qua th&#xF4;i. &#x110;&#x1EBF;n con ng&#x1B0;&#x1EDD;i c&#x169;ng kh&#xF4;ng &#x1EDF; l&#x1EA1;i m&#xE3;i, ch&#x1EB3;ng c&#xF3; g&#xEC; c&#x1EE9; &#x1EDF; l&#x1EA1;i m&#xE3;i m&#xE3;i.</p>
<p>Thi tho&#x1EA3;ng t&#xF4;i l&#x1EA1;i ch&#x1ECD;n m&#x1ED9;t ng&#xE0;y l&#xE0;m ng&#xE0;y &#x111;&#x1EB9;p tr&#x1EDD;i c&#x1EE7;a m&#xEC;nh, ng&#xE0;y &#x111;&#x1B0;&#x1EE3;c kh&#xE1;c &#x111;i m&#x1ED9;t ch&#xFA;t, g&#x1EB7;p ng&#x1B0;&#x1EDD;i kh&#xE1;c m&#x1ED9;t ch&#xFA;t, n&#xF3;i nh&#x1EEF;ng c&#xE2;u kh&#xE1;c m&#x1ED9;t ch&#xFA;t, ngh&#x129; nh&#x1EEF;ng &#x111;i&#x1EC1;u kh&#xE1;c m&#x1ED9;t ch&#xFA;t. Ch&#x1EC9; l&#xE0; cho ph&#xE9;p b&#x1EA3;n th&#xE2;n &#x111;&#x1B0;&#x1EE3;c chui v&#xE0;o m&#x1ED9;t g&#xF3;c tr&#x1EDD;i kh&#xE1;c &#x111;&#x1EC3; n&#x1EA1;p l&#x1EA1;i t&#xE2;m h&#x1ED3;n.</p>
<p>R&#x1ED3;i tr&#x1EDF; l&#x1EA1;i.</p>
]]></content>
        <author>
            <name>Quoc Khanh</name>
            <email>khanhbq@innoteq.vn</email>
            <uri>https://khanhquoc.press/about</uri>
        </author>
    </entry>
    <entry>
        <title type="html"><![CDATA[Thiên đàng là nơi code ngự trị]]></title>
        <id>https://khanhquoc.press/blog/thien-dan-la-noi-code-ngu-tri/</id>
        <link href="https://khanhquoc.press/blog/thien-dan-la-noi-code-ngu-tri/">
        </link>
        <updated>2017-07-10T17:00:00Z</updated>
        <summary type="html"><![CDATA[Đi hết ngày dài, đôi vai cũng mỏi. Tựa lưng vào góc cà phê quen, vây quanh bởi ánh đèn toả vàng, bản "Death And All His Friends" vang êm, chỉ khiến tôi lại muốn mở ngay cái laptop mà gõ mấy nhịp hối hả khẽ khàng.]]></summary>
        <content type="html"><![CDATA[<figure><img src="https://khanhquoc.press/blog/thien-dan-la-noi-code-ngu-tri/life.jpg" alt="&quot;Epic scene from Doctor Strange movie&quot;" class="full-width"><figcaption>&quot;Epic scene from Doctor Strange movie&quot;</figcaption></figure>
<blockquote>
<p>C&#xE1;i ch&#x1EBF;t l&#xE0;m cho cu&#x1ED9;c s&#x1ED1;ng tr&#x1EDF; n&#xEA;n &#xFD; ngh&#x129;a, r&#x1EB1;ng bao nhi&#xEA;u th&#xE1;ng ng&#xE0;y v&#x1EAB;n ch&#x1EC9; l&#xE0; nh&#x1EEF;ng con s&#x1ED1;, r&#x1EB1;ng c&#xE1;i g&#x1ECD;i l&#xE0; th&#x1EDD;i gian lu&#xF4;n lu&#xF4;n b&#x1ECB; gi&#x1EDB;i h&#x1EA1;n.</p>
</blockquote>
<p>&#x110;i h&#x1EBF;t ng&#xE0;y d&#xE0;i, &#x111;&#xF4;i vai c&#x169;ng m&#x1ECF;i. T&#x1EF1;a l&#x1B0;ng v&#xE0;o g&#xF3;c c&#xE0; ph&#xEA; quen, v&#xE2;y quanh b&#x1EDF;i &#xE1;nh &#x111;&#xE8;n to&#x1EA3; v&#xE0;ng, b&#x1EA3;n &#x201C;<a href="https://open.spotify.com/album/1CEODgTmTwLyabvwd7HBty">Death And All His Friends</a>&#x201D; vang &#xEA;m, ch&#x1EC9; khi&#x1EBF;n t&#xF4;i l&#x1EA1;i mu&#x1ED1;n m&#x1EDF; ngay c&#xE1;i laptop m&#xE0; g&#xF5; m&#x1EA5;y nh&#x1ECB;p h&#x1ED1;i h&#x1EA3; kh&#x1EBD; kh&#xE0;ng.</p>
<h3>C&#xF4;ng vi&#x1EC7;c, t&#xEC;nh c&#x1EA3;m, gia &#x111;&#xEC;nh</h3>
<p>L&#xE0;m sao &#x111;&#x1EC3; d&#x1EEB;ng l&#x1EA1;i &#x1EDF; &#x111;&#xE2;u &#x111;&#xF3; m&#xE0; cho ph&#xE9;p m&#xEC;nh ch&#xE9;p ghi v&#x1ED9;i m&#x1EA5;y d&#xF2;ng t&#xE2;m t&#x1B0; ch&#x1EC9; k&#x1ECB;p l&#x1B0;&#x1EDB;t qua r&#x1EA5;t kh&#x1EBD;, m&#xE0; th&#x1EE9;c d&#x1EAD;y mu&#x1ED9;n h&#x1A1;n m&#x1EA5;y m&#x1B0;&#x1A1;i ph&#xFA;t m&#x1ED7;i s&#x1EDB;m h&#xF4;m &#x111;&#x1EC3; kh&#x1ECF;i ph&#x1EA3;i ng&#x1EAF;m &#xE1;nh b&#xEC;nh minh, m&#xE0; b&#x1EAF;t ch&#x1ED9;p &#x111;&#x1B0;&#x1EE3;c kh&#x1EAF;c kho&#x1EA3;nh d&#xE3;y &#x111;&#xE8;n c&#xF4;ng vi&#xEA;n &#x111;ang s&#xE1;ng d&#x1EA7;n khi m&#xE0;n &#x111;&#xEA;m bu&#xF4;ng xu&#x1ED1;ng.</p>
<figure><img src="https://khanhquoc.press/blog/thien-dan-la-noi-code-ngu-tri/vivalavida.jpg" alt="&quot;Viva La Vida&quot;" class="full-width"><figcaption>&quot;Viva La Vida&quot;</figcaption></figure>
<p>&#x2026;M&#xE0; ch&#x1EB3;ng ng&#xF3; ng&#xE0;ng t&#x1EDB;i nh&#x1EEF;ng th&#x1EE9; quanh m&#xEC;nh d&#xF9; ch&#x1EC9; m&#x1ED9;t ph&#xFA;t gi&#xE2;y, ch&#x1EC9; &#x111;&#x1EC3; l&#x1EAF;ng nghe Viva La Vida c&#x1EA3; &#x111;&#xEA;m d&#xE0;i.</p>
<p>Cu&#x1ED9;c s&#x1ED1;ng kh&#xF4;ng h&#x1EB3;n &#x111;&#xE3; ng&#x1EAF;n ng&#x1EE7;i, s&#x1ED1;ng l&#xE0; &#x111;i&#x1EC1;u d&#xE0;i nh&#x1EA5;t ng&#x1B0;&#x1EDD;i ta c&#xF3; th&#x1EC3; th&#x1EF1;c hi&#x1EC7;n.</p>
<h3>Thi&#xEA;n &#x111;&#xE0;ng</h3>
<p>Kho&#x1EA3;ng th&#x1EDD;i gian n&#xE0;y t&#xF4;i th&#x1EF1;c s&#x1EF1; y&#xEA;u th&#xED;ch v&#xE0; tin t&#x1B0;&#x1EDF;ng v&#xE0;o nh&#x1EEF;ng g&#xEC; m&#xEC;nh &#x111;ang l&#xE0;m, d&#xF9; m&#x1ED9;t l&#x1ED7;i ch&#x1B0;&#x1A1;ng tr&#xEC;nh, m&#x1ED9;t thi&#x1EBF;u s&#xF3;t nh&#x1ECF;, hay m&#x1ED9;t th&#x1EBF; l&#x1EF1;c k&#x1EF3; l&#x1EA1; nhi&#x1EC1;u khi ch&#x1EB3;ng th&#x1EC3; gi&#x1EA3;i th&#xED;ch &#x111;&#x1B0;&#x1EE3;c c&#xF3; th&#x1EC3; khi&#x1EBF;n c&#x1EA3; h&#x1EC7; th&#x1ED1;ng ng&#x1EEB;ng ho&#x1EA1;t &#x111;&#x1ED9;ng v&#xE0; m&#x1EA5;t c&#x1EA3; tu&#x1EA7;n &#x111;&#x1EC3; gi&#x1EA3;i quy&#x1EBF;t.</p>
<p>D&#xF9; cho c&#xF4;ng vi&#x1EC7;c b&#x1ED9;n b&#x1EC1; c&#xF3; khi&#x1EBF;n b&#x1EA3;n th&#xE2;n nhi&#x1EC1;u mu&#x1ED9;n phi&#x1EC1;n.</p>
<p>Thi&#xEA;n &#x111;&#xE0;ng l&#xE0; n&#x1A1;i code ng&#x1EF1; tr&#x1ECB;. Code l&#xE0; b&#xE0;i th&#x1A1; bu&#x1ED3;n, code l&#xE0; b&#x1EA3;n nh&#x1EA1;c du d&#x1B0;&#x1A1;ng.</p>
<blockquote>
<p>And&#x2026; in the end we lie awake, and we dream of making our escape</p>
</blockquote>
<p>V&#xE0; d&#x1EAB;u, &#x1EEB; th&#xEC; c&#xF3; h&#x1A1;i quen thu&#x1ED9;c, code l&#xE0; ngh&#x1EC7; thu&#x1EAD;t, m&#x1EB7;c ai &#x111;&#xF3; c&#xF3; n&#xF3;i g&#xEC;, ng&#x1B0;&#x1EDD;i vi&#x1EBF;t code v&#x1EAB;n l&#xE0; m&#x1ED9;t ngh&#x1EC7; s&#x129;.</p>
<figure><img src="https://khanhquoc.press/blog/thien-dan-la-noi-code-ngu-tri/thichlammoc.jpg" alt="" class="full-width"></figure>
]]></content>
        <author>
            <name>Quoc Khanh</name>
            <email>khanhbq@innoteq.vn</email>
            <uri>https://khanhquoc.press/about</uri>
        </author>
    </entry>
    <entry>
        <title type="html"><![CDATA[Thực hiện dự án full-stack đầu tiên]]></title>
        <id>https://khanhquoc.press/blog/thuc-hien-du-an-full-stack-dau-tien/</id>
        <link href="https://khanhquoc.press/blog/thuc-hien-du-an-full-stack-dau-tien/">
        </link>
        <updated>2017-07-16T17:00:00Z</updated>
        <summary type="html"><![CDATA[Đó là một ngày trời nhiều nắng, một khoảng thời gian đẹp, loay hoay với những nỗi niềm riêng, là khi tôi biết mình cần phải ngồi xuống đâu đó, và code.]]></summary>
        <content type="html"><![CDATA[<p>&#x110;&#xF3; l&#xE0; m&#x1ED9;t ng&#xE0;y tr&#x1EDD;i nhi&#x1EC1;u n&#x1EAF;ng, m&#x1ED9;t kho&#x1EA3;ng th&#x1EDD;i gian &#x111;&#x1EB9;p, loay hoay v&#x1EDB;i nh&#x1EEF;ng n&#x1ED7;i ni&#x1EC1;m ri&#xEA;ng, l&#xE0; khi t&#xF4;i bi&#x1EBF;t m&#xEC;nh c&#x1EA7;n ph&#x1EA3;i ng&#x1ED3;i xu&#x1ED1;ng &#x111;&#xE2;u &#x111;&#xF3;, v&#xE0; code.
C&#x169;ng ch&#x1EB3;ng ph&#x1EA3;i l&#xE0; c&#xE2;u chuy&#x1EC7;n x&#xFA;c &#x111;&#x1ED9;ng hay gi&#xE0;u c&#x1EA3;m h&#x1EE9;ng, &#xFD; t&#x1B0;&#x1EDF;ng c&#x1EE7;a d&#x1EF1; &#xE1;n ch&#x1EE3;t &#x111;&#x1EBF;n khi b&#x1EA3;n th&#xE2;n &#x111;ang &#x111;i t&#xEC;m &#xFD; t&#x1B0;&#x1EDF;ng cho d&#x1EF1; &#xE1;n (haha). Ecommerce v&#xE0; location based, hai kh&#xE1;i ni&#x1EC7;m kh&#xF4;ng c&#xF2;n xa l&#x1EA1; v&#x1EDB;i th&#x1EBF; gi&#x1EDB;i ng&#xE0;y h&#xF4;m nay, &#x111;&#x1EB7;c bi&#x1EC7;t khi Amazon, Lazada, Uber, Grab,&#x2026; &#x111;ang ph&#xE1;t tri&#x1EC3;n m&#x1EA1;nh m&#x1EBD;. Nh&#x1B0;ng ch&#x1EAF;c do ngh&#x129; m&#xEC;nh v&#x1EAB;n c&#xF3; th&#x1EC3; l&#xE0;m &#x111;i&#x1EC1;u g&#xEC; &#x111;&#xF3; t&#x1ED1;t, n&#xEA;n c&#x1EE9; &#x111;&#x1A1;n gi&#x1EA3;n l&#xE0; b&#x1EAF;t &#x111;&#x1EA7;u. B&#x1EDF;i c&#x169;ng l&#xE2;u qu&#xE1; kh&#xF4;ng l&#xE0;m g&#xEC; cho ri&#xEA;ng m&#xEC;nh, <a href="https://khanhquoc.press/blog/chieu-ve-muon-tren-duong-khoi-nghiep/">m&#xE0; d&#xF2;ng ng&#x1B0;&#x1EDD;i ng&#x1B0;&#x1EE3;c xu&#xF4;i ngo&#xE0;i kia, ch&#x1EB3;ng l&#xFA;c n&#xE0;o ng&#x1A1;i ngh&#x1EC9;</a>.</p>
<h3>Backend</h3>
<figure><img src="https://khanhquoc.press/blog/thuc-hien-du-an-full-stack-dau-tien/https://i.imgur.com/r22vgxN.jpg" alt="Working" class="full-width"><figcaption>Working</figcaption></figure>
<blockquote>
<p>Any application that can be written in JavaScript, will eventually be written in JavaScript. - Jeff Atwood</p>
</blockquote>
<p>B&#x1EA3;n th&#xE2;n t&#xF4;i r&#x1EA5;t y&#xEA;u th&#xED;ch JavaScript c&#x169;ng nh&#x1B0; <a href="https://nodejs.org/">NodeJS</a>. JavaScript mang trong m&#xEC;nh m&#x1ED9;t phong th&#xE1;i r&#x1EA5;t nh&#x1EB9; nh&#xE0;ng v&#xE0; ph&#xF3;ng kho&#xE1;ng, ch&#x1EB3;ng qu&#xE1; khu&#xF4;n kh&#x1ED5;, ch&#x1EB3;ng qu&#xE1; &#x111;&#x1A1;n &#x111;i&#x1EC7;u, &#x111;&#x1EE7; &#x111;&#x1EC3; kh&#xF4;ng l&#xE0;m t&#xF4;i r&#x1ED1;i lo&#x1EA1;n trong m&#x1ED9;t m&#x1EDB; code b&#xF2;ng boong.
&#x110;&#xF3; l&#xE0; l&#xFD; do v&#xEC; sao NodeJS l&#xE0; &#x1B0;u ti&#xEA;n h&#xE0;ng &#x111;&#x1EA7;u cho ph&#x1EA7;n backend khi t&#xF4;i b&#x1EAF;t tay v&#xE0;o th&#x1EF1;c hi&#x1EC7;n d&#x1EF1; &#xE1;n.</p>
<figure><img src="https://khanhquoc.press/blog/thuc-hien-du-an-full-stack-dau-tien/https://source.unsplash.com/vfzfavUZmfc/1600x900" alt="Map" class="full-width"><figcaption>Map</figcaption></figure>
<p>L&#xE0; m&#x1ED9;t s&#x1EA3;n ph&#x1EA9;m ho&#x1EA1;t &#x111;&#x1ED9;ng &#x111;a ph&#x1EA7;n tr&#xEA;n b&#x1EA3;n &#x111;&#x1ED3;, d&#x1EF1; &#xE1;n &#x111;&#xF2;i h&#x1ECF;i ph&#x1EA3;i x&#xE1;c &#x111;&#x1ECB;nh v&#x1ECB; tr&#xED; v&#xE0; truy v&#x1EA5;n kho&#x1EA3;ng c&#xE1;ch c&#x1EE7;a c&#xE1;c &#x111;&#x1ED1;i t&#x1B0;&#x1EE3;ng. Google v&#xE0; t&#xEC;m &#x111;&#x1B0;&#x1EE3;c v&#xE0;i k&#x1EBF;t qu&#x1EA3; c&#xF3; v&#x1EBB; h&#x1EE9;a h&#x1EB9;n:</p>
<ul>
<li><a href="https://git.daplie.com/Daplie/s2-geometry.js">s2 Geometry c&#x1EE7;a Google</a>, &#x111;&#x1B0;&#x1EE3;c s&#x1EED; d&#x1EE5;ng b&#x1EDF;i Ingress v&#xE0; Pokemon Go, &#x111;&#xE1;ng &#x111;&#x1EC3; th&#x1EED;.</li>
<li><a href="https://en.wikipedia.org/wiki/Haversine_formula">Haversine Formula</a>, th&#xFA; v&#x1ECB;, nh&#x1B0;ng implement s&#x1EBD; kh&#xF4;ng d&#x1EC5; d&#xE0;ng.</li>
<li>V&#xE0; <a href="https://docs.mongodb.com/manual/geospatial-queries/">Mongo Geospatial</a>. Bingo!!!</li>
</ul>
<figure><img src="https://khanhquoc.press/blog/thuc-hien-du-an-full-stack-dau-tien/https://source.unsplash.com/Cc4sToR2Oc0/1600x900" alt="Dream Big" class="full-width"><figcaption>Dream Big</figcaption></figure>
<p>L&#xE0; c&#x1A1; s&#x1EDF; d&#x1EEF; li&#x1EC7;u noSQL k&#x1EBF;t h&#x1EE3;p tuy&#x1EC7;t v&#x1EDD;i v&#x1EDB;i NodeJS, mongoDB c&#xF3; &#x111;&#x1EE7; t&#xED;nh linh ho&#x1EA1;t cho m&#x1ED9;t side project m&#xE0; v&#x1EAB;n &#x111;&#x1EA3;m b&#x1EA3;o hi&#x1EC7;u n&#x103;ng v&#xE0; t&#x1ED1;c &#x111;&#x1ED9; cho m&#x1ED9;t &#x1EE9;ng d&#x1EE5;ng h&#x1B0;&#x1EDB;ng &#x111;&#x1EBF;n kh&#x1ED1;i l&#x1B0;&#x1EE3;ng l&#x1EDB;n ng&#x1B0;&#x1EDD;i d&#xF9;ng v&#xE0; nh&#x1EEF;ng truy v&#x1EA5;n. C&#x169;ng c&#xF3; &#x111;&#x1B0;&#x1EE3;c kho&#x1EA3;ng th&#x1EDD;i gian ti&#x1EBF;p x&#xFA;c c&#xE0;ng khi&#x1EBF;n t&#xF4;i mu&#x1ED1;n d&#xE0;nh th&#xEA;m t&#xEC;nh c&#x1EA3;m cho mongoDB, v&#xE0; c&#xF3; th&#x1EC3; n&#xF3;i &#x111;&#x1EBF;n hi&#x1EC7;n t&#x1EA1;i t&#xF4;i ch&#x1B0;a t&#x1EEB;ng ph&#x1EA3;i h&#x1ED1;i h&#x1EAD;n v&#x1EDB;i quy&#x1EBF;t &#x111;&#x1ECB;nh n&#xE0;y.
L&#xFA;c vi&#x1EBF;t b&#xE0;i n&#xE0;y t&#xF4;i &#x111;&#xE3; c&#x1A1; b&#x1EA3;n ho&#xE0;n th&#xE0;nh &#x111;&#x1B0;&#x1EE3;c ph&#x1EA7;n query v&#xE0; x&#x1EED; l&#xFD; location, c&#x1EA3;m gi&#xE1;c c&#x1EF1;c k&#xEC; h&#x1B0;ng ph&#x1EA5;n!</p>
<h3>ReactJS</h3>
<p>N&#x1EBF;u c&#xF3; ai h&#x1ECF;i c&#xF4;ng ngh&#x1EC7; n&#xE0;o l&#xE0;m t&#xF4;i &#x1EA5;n t&#x1B0;&#x1EE3;ng nh&#x1EA5;t nh&#x1EEF;ng n&#x103;m g&#x1EA7;n &#x111;&#xE2;y, c&#xE2;u tr&#x1EA3; l&#x1EDD;i ch&#x1EAF;c ch&#x1EAF;n ph&#x1EA3;i l&#xE0; React.</p>
<figure><img src="https://khanhquoc.press/blog/thuc-hien-du-an-full-stack-dau-tien/https://source.unsplash.com/aI1tDC8PaLM/1600x900" alt="ReactJS" class="full-width"><figcaption>ReactJS</figcaption></figure>
<p>Nh&#x1EEF;ng m&#x1EF9; t&#x1EEB; t&#x1ED1;t &#x111;&#x1EB9;p nh&#x1EA5;t &#x111;&#x1EC3; d&#xE0;nh cho React c&#xF3; l&#x1EBD; ch&#x1EB3;ng c&#x1EA7;n thi&#x1EBF;t n&#x1EEF;a. React b&#xE2;y gi&#x1EDD; kh&#xF4;ng c&#xF2;n &#x111;&#x1A1;n thu&#x1EA7;n l&#xE0; m&#x1ED9;t th&#x1B0; vi&#x1EC7;n JavaScript. V&#x1EDB;i s&#x1EF1; ra &#x111;&#x1EDD;i c&#x1EE7;a React Native c&#xF9;ng r&#x1EA5;t nhi&#x1EC1;u nh&#x1EEF;ng project m&#xE3; ngu&#x1ED3;n m&#x1EDF; &#x111;i k&#xE8;m, React th&#x1EF1;c s&#x1EF1; &#x111;&#xE3; tr&#x1EDF; th&#xE0;nh m&#x1ED9;t h&#x1EC7; sinh th&#xE1;i, n&#x1A1;i l&#x1EAD;p tr&#xEC;nh vi&#xEA;n kh&#xF4;ng c&#xF2;n ph&#x1EA3;i loay hoay v&#x1EDB;i v&#xF4; s&#x1ED1; nh&#x1EEF;ng ng&#xF4;n ng&#x1EEF; &#x111;&#x1EC3; t&#x1EA1;o ra s&#x1EA3;n ph&#x1EA9;m c&#xF3; th&#x1EC3; ti&#x1EBF;p c&#x1EAD;n v&#x1EDB;i nhi&#x1EC1;u ng&#x1B0;&#x1EDD;i s&#x1EED; d&#x1EE5;ng nh&#x1EA5;t c&#xF3; th&#x1EC3;.</p>
<p><a href="https://www.youtube.com/watch?v=MGuKhcnrqGA">React thay &#x111;&#x1ED5;i t&#x1B0; duy c&#x1EE7;a l&#x1EAD;p tr&#xEC;nh vi&#xEA;n v&#x1EC1; quy tr&#xEC;nh th&#x1EF1;c hi&#x1EC7;n s&#x1EA3;n ph&#x1EA9;m, thay &#x111;&#x1ED5;i c&#xE1;ch th&#x1EE9;c nh&#xF3;m ho&#x1EA1;t &#x111;&#x1ED9;ng.</a></p>
<h3>Learn Once, Write Everywhere</h3>
<p>T&#xF4;n ch&#x1EC9; n&#x1ED5;i ti&#x1EBF;ng c&#x1EE7;a Java l&#xE0; &#x201C;Write Once, Run Everywhere&#x201D;, c&#xF3; t&#x1EA7;m &#x1EA3;nh h&#x1B0;&#x1EDF;ng l&#x1EDB;n t&#x1EDB;i r&#x1EA5;t nhi&#x1EC1;u ng&#xF4;n ng&#x1EEF; v&#xE0; c&#xF4;ng c&#x1EE5; gi&#xFA;p vi&#x1EBF;t &#x1EE9;ng d&#x1EE5;ng &#x111;a n&#x1EC1;n t&#x1EA3;ng sau n&#xE0;y. React kh&#xF4;ng r&#x1EBD; theo h&#x1B0;&#x1EDB;ng &#x111;i n&#xE0;y.
Nhi&#x1EC1;u ng&#x1B0;&#x1EDD;i nh&#x1EA7;m l&#x1EAB;n r&#x1EB1;ng React Native cho ph&#xE9;p l&#x1EAD;p tr&#xEC;nh vi&#xEA;n vi&#x1EBF;t &#x1EE9;ng d&#x1EE5;ng m&#x1ED9;t l&#x1EA7;n v&#xE0; c&#xF3; th&#x1EC3; ch&#x1EA1;y &#x111;&#x1B0;&#x1EE3;c tr&#xEA;n nhi&#x1EC1;u n&#x1EC1;n t&#x1EA3;ng, nh&#x1B0;ng s&#x1EF1; th&#x1EAD;t kh&#xF4;ng ph&#x1EA3;i v&#x1EAD;y.</p>
<blockquote>
<p>&#x201C;Learn Once, Write Everywhere&#x201D;</p>
</blockquote>
<p>Nh&#x1EEF;ng n&#x1EC1;n t&#x1EA3;ng kh&#xE1;c nhau c&#xF3; m&#x1ED9;t ng&#xF4;n ng&#x1EEF; thi&#x1EBF;t k&#x1EBF; kh&#xE1;c nhau, l&#xE0; c&#xE1;i t&#x1B0;&#x1A1;i m&#x1EDB;i tr&#x1EBB; trung c&#x1EE7;a Human Interface tr&#xEA;n iOS hay ch&#x1EA5;t li&#x1EC7;u hi&#x1EC7;n &#x111;&#x1EA1;i m&#xE0; Material Design &#x111;em &#x111;&#x1EBF;n cho Android.
V&#x1EBB; &#x111;&#x1EB9;p c&#x1EE7;a React Native n&#x1EB1;m &#x1EDF; vi&#x1EC7;c m&#x1ED9;t khi &#x111;&#xE3; n&#x1EAF;m &#x111;&#x1B0;&#x1EE3;c concepts, m&#xEC;nh c&#xF3; th&#x1EC3; &#xE1;p d&#x1EE5;ng n&#xF3; l&#xEA;n nhi&#x1EC1;u n&#x1EC1;n t&#x1EA3;ng. B&#x1EDF;i cho c&#xF9;ng, tr&#x1EA3;i nghi&#x1EC7;m ng&#x1B0;&#x1EDD;i d&#xF9;ng m&#x1EDB;i l&#xE0; th&#x1EE9; t&#x1ED1;i quan tr&#x1ECD;ng.</p>
<p><a href="https://code.facebook.com/posts/1014532261909640/react-native-bringing-modern-web-techniques-to-mobile/">React Native: Bringing modern web techniques to mobile | Engineering Blog | Facebook Code | Facebook</a></p>
<h3>Full-stack &#x1F433;</h3>
<p>C&#x169;ng &#x111;&#xE3; tr&#xF2;n m&#x1ED9;t th&#xE1;ng k&#x1EC3; t&#x1EEB; hai c&#xE1;i &#x201C;initial commit&#x201D;, m&#x1ED9;t cho mobile client, m&#x1ED9;t cho api. V&#x1EAD;y l&#xE0; c&#x1ED1; g&#x1EAF;ng s&#x1EAF;p x&#x1EBF;p th&#x1EDD;i gian h&#x1ECD;c t&#x1EAD;p v&#xE0; c&#xF4;ng vi&#x1EC7;c g&#x1ECD;n g&#xE0;ng nh&#x1EA5;t c&#xF3; th&#x1EC3; &#x111;&#x1EC3; d&#xE0;nh m&#x1ED9;t g&#xF3;c vui v&#x1EBB; ba gi&#x1EDD; m&#x1ED7;i t&#x1ED1;i cho d&#x1EF1; &#xE1;n, th&#x1EAD;m ch&#xED; &#x111;&#x1B0;&#x1EE3;c tu&#x1EA7;n ngh&#x1EC9; h&#xE8; c&#x169;ng b&#x1ECB; h&#x1EAF;n t&#x1EAD;n d&#x1EE5;ng tri&#x1EC7;t &#x111;&#x1EC3; &#x1F924;</p>
<figure><img src="https://khanhquoc.press/blog/thuc-hien-du-an-full-stack-dau-tien/https://i.imgur.com/Yk1t5kJ.jpg" alt="Summer Vacation" class="full-width"><figcaption>Summer Vacation</figcaption></figure>
<p>M&#x1ED9;t m&#xEC;nh l&#xE0;m full-stack, &#x111;&#x1B0;&#x1EE3;c c&#xE1;i t&#x1EF1; ch&#x1EE7; b&#x1EA3;n th&#xE2;n, nh&#x1B0;ng kh&#xF3; kh&#x103;n th&#xEC; nhi&#x1EC1;u l&#x1EAF;m. Kh&#x1ED1;i l&#x1B0;&#x1EE3;ng c&#xF4;ng vi&#x1EC7;c ph&#x1EA3;i l&#xE0;m l&#xE0; r&#x1EA5;t l&#x1EDB;n. L&#xE0;m UI ph&#x1EA3;i l&#xE0;m sao cho tinh t&#x1EBF;, ti&#x1EC7;n d&#x1EE5;ng. L&#xE0;m API ph&#x1EA3;i l&#xE0;m sao ch&#xED;nh x&#xE1;c, b&#x1EA3;o m&#x1EAD;t. Nhi&#x1EC1;u khi n&#x1EBF;u kh&#xF4;ng c&#xF3; lon bia th&#xEC; ch&#x1EAF;c &#x111;&#xE3; kh&#xF4;ng qua kh&#x1ECF;i &#x1F603;)
Th&#x1EED; th&#xE1;ch n&#x1EEF;a t&#xF4;i &#x111;ang ph&#x1EA3;i &#x111;&#x1ED1;i m&#x1EB7;t l&#xE0; implement realtime, v&#x1EDB;i v&#x1ED1;n kinh nghi&#x1EC7;m ho&#xE0;n th&#xE0;nh v&#xE0;i ba &#x1EE9;ng d&#x1EE5;ng nh&#x1EAF;n tin, caro t&#x1EF1; s&#x1B0;&#x1EDB;ng th&#x1EDD;i gian th&#x1EF1;c, b&#x1EA3;n th&#xE2;n c&#x169;ng kh&#xF4;ng ho&#xE0;n to&#xE0;n t&#x1EF1; tin v&#x1EC1; kh&#x1EA3; n&#x103;ng l&#xE0;m WebSocket c&#x1EE7;a m&#xEC;nh.
Nh&#x1B0;ng c&#x169;ng ch&#x1EB3;ng sao, ch&#x1EC9; c&#x1EA7;n c&#xF2;n s&#x1EF1; tin t&#x1B0;&#x1EDF;ng, l&#xE0; l&#xE0;m &#x111;&#x1B0;&#x1EE3;c.</p>
<h3>Goodbye Yellow Brick Road</h3>
<p>&#x1EEA; th&#xEC; c&#x1EE9; v&#x1EAD;y m&#xE0; ti&#x1EBF;p t&#x1EE5;c. M&#x1EE5;c ti&#xEA;u c&#x1EE7;a b&#x1EA3;n th&#xE2;n khi th&#x1EF1;c hi&#x1EC7;n s&#x1EA3;n ph&#x1EA9;m n&#xE0;y kh&#xF4;ng g&#xEC; kh&#xE1;c l&#xE0; mu&#x1ED1;n n&#xF3; c&#xF3; th&#x1EC3; &#x111;i v&#xE0;o ho&#x1EA1;t &#x111;&#x1ED9;ng v&#xE0; gi&#xFA;p &#xED;ch cho ng&#x1B0;&#x1EDD;i s&#x1EED; d&#x1EE5;ng, hy v&#x1ECD;ng phi&#xEA;n b&#x1EA3;n &#x111;&#x1EA7;u ti&#xEA;n s&#x1EBD; &#x111;&#x1B0;&#x1EE3;c ho&#xE0;n thi&#x1EC7;n trong v&#xE0;i tu&#x1EA7;n t&#x1EDB;i.</p>
<figure><img src="https://khanhquoc.press/blog/thuc-hien-du-an-full-stack-dau-tien/https://i.imgur.com/m9GHc7M.jpg" alt="Goodbye Yello Brick Road" class="full-width"><figcaption>Goodbye Yello Brick Road</figcaption></figure>
<p>M&#x1EDB;i &#x111;&#xF3; &#x111;&#xE3; hai gi&#x1EDD; s&#xE1;ng, m&#xE0; b&#x1EA3;n <a href="https://open.spotify.com/track/4IRHwIZHzlHT1FQpRa5RdE">Goodbye Yellow Brick Road</a> v&#x1EAB;n &#x111;ang th&#x1ED5;n th&#x1EE9;c, c&#xF2;n t&#xF4;i v&#x1EAB;n m&#xEA; say trong &#x111;&#x1ED1;ng code ng&#x1ED5;n ngang.
L&#x1EA1;i m&#x1ED9;t ng&#xE0;y n&#x1EEF;a tr&#xF4;i qua, m&#x1ED9;t ng&#xE0;y tr&#x1EDD;i s&#x1EBD; nhi&#x1EC1;u n&#x1EAF;ng.</p>
]]></content>
        <author>
            <name>Quoc Khanh</name>
            <email>khanhbq@innoteq.vn</email>
            <uri>https://khanhquoc.press/about</uri>
        </author>
    </entry>
</feed>